jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
/*==============================================================================
Copyright © 2005 Xantrex International

This file is the property of Xantrex International and shall not be reproduced,
copied, or used as the basis for the manufacture or sale of equipment without
the express written permission of Xantrex International.

FILE NAME:
    F280xBitDefines.h

PURPOSE:
    The purpose of this file is to provide a central repository for all of the
    bit field functionality #defines for the registers on the 280x DSP.

FUNCTION(S):
    None

NOTES:

    ---------------------------------------------------------------------------
    What on earth is a "bit field functionality #define"?
    ---------------------------------------------------------------------------
    For each register each bit field has a set of different options, some are
    just simple 0 or 1 (on / off - enabled / disabled ) but some are more
    complex.  These bit fields represent the different possible options that
    can be assigned to the particular register bits.
    ---------------------------------------------------------------------------

    ---------------------------------------------------------------------------
    How do I add new defines to this file?
    ---------------------------------------------------------------------------
    First, check to ensure that someone hasn't already defined what you're
    trying to define with a slightly different name.  The file is organized
    first by register, then by function.  If you're adding a register
    state value make sure that you put it with that register.  If you're
    adding a new register, make sure you follow the same commenting practices
    shown in the rest of the file.

    In general the format of the define is as follows:

    #define F280X_<REGISTER>_<BIT FIELD>_<FUNCTION>       <VALUE>

    Exceptions to this formatting are acceptable provided they make sense. 
    ---------------------------------------------------------------------------

CHANGE HISTORY:
$Log: F280xBitDefines.h $

    ***********************************************
    Revision: SurveyorPfrmA_JeffF/6
    User: JeffF     Date: 02/13/06  Time: 06:59PM
    Ran the copyright updater script to bring the copyright notice on all project
    files up to date.

    ***********************************************
    Revision: SurveyorPfrmA_JeffF/5
    User: JeffF     Date: 05/31/05  Time: 10:25PM
    Changed the defines for the ADC registers. Started using the NFO macros
    so that registers can be intialized in a more code efficient manner.

    ***********************************************
    Revision: SurveyorPfrmA_JeffF/4
    User: JeffF     Date: 05/20/05  Time: 04:29PM
    Added defines for Action Qualifier control registers on the PWM modules.

    
    ***********************************************
    Revision: SurveyorPfrmA_JeffF/3
    User: JeffF     Date: 05/05/05  Time: 12:20AM
    Made minor change to name of one of the defines

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/7
    User: HueyD     Date: 04/27/05  Time: 05:13PM
    commented

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/6
    User: HueyD     Date: 04/26/05  Time: 02:52AM
    Attempt to reduce code size

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/5
    User: HueyD     Date: 04/25/05  Time: 05:54PM
    Added high res

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/4
    User: HueyD     Date: 04/23/05  Time: 01:12AM
    Used new defines and new paths

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/3
    User: HueyD     Date: 04/22/05  Time: 11:14PM
    Created new way of defining 16bit registers

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/2
    User: HueyD     Date: 04/14/05  Time: 06:19PM
    simplified defines

    ***********************************************
    Revision: SurveyorPfrmA_HueyD/1
    User: HueyD     Date: 04/13/05  Time: 09:40PM
    Added macros for bit manipulation.

    ***********************************************
    Revision: SurveyorPfrmA_JeffF/2
    User: JeffF     Date: 04/12/05  Time: 10:26PM
    Added some more defines for the ADC module.

==============================================================================*/

#ifndef F280X_BIT_DEFINES_H
#define F280X_BIT_DEFINES_H


/*==============================================================================
                              Includes
==============================================================================*/


/*==============================================================================
                              Defines
==============================================================================*/

// Define a macro to convert number of bits into an unshifted bit mask
#define F280X_mBITS_TO_MSK_UNSHFTD( bits ) ( ~( 0xFFFF << bits ) )

// Each NFO (info) define is made up of 2 values:
//     1.  The bit position of a field's right most member
//     2.  The number of bits the field utilizes
#define F280X_NFO_POS_BITS  8
#define F280X_NFO_BITS_BITS 8
#define F280X_NFO_POS_SHFT  F280X_NFO_BITS_BITS
#define F280X_NFO_BITS_SHFT 0
#define F280X_NFO_POS_MSK   ( F280X_mBITS_TO_MSK_UNSHFTD( F280X_NFO_POS_BITS ) \
                                << F280X_NFO_POS_SHFT )
#define F280X_NFO_BITS_MSK  ( F280X_mBITS_TO_MSK_UNSHFTD( F280X_NFO_BITS_BITS )\
                                << F280X_NFO_BITS_SHFT )
#define F280X_mNFO( pos, bits ) ( ( pos  << F280X_NFO_POS_SHFT ) \
                                | ( bits << F280X_NFO_BITS_SHFT ) )

// Clears and then sets a register using masks in the proper field
#define F280X_mCLR_N_SET_MSK( Reg, Msk, CfgMsk ) \
            Reg &= ~Msk; \
            Reg |= CfgMsk

#define F280X_mCLR_N_SET_FIELD ( Reg, Pos, Bits, Cfg ) \
            Reg &= ~( F280X_mBITS_TO_MSK_UNSHFTD( Bits ) << Pos ); \
            Reg |=  ( Cfg << Pos )
#define F280X_mSET_FIELD( Reg, Pos, Cfg ) \
            Reg |=  ( Cfg << Pos )
 
// ---------------------------------------------------------------------------
// Defines based on device registers.
// ---------------------------------------------------------------------------

//
// Peripheral Clock Register (PCLKCR)
//
#define F280X_PCLKCR_CLK_OFF                     ( 0x00 ) // ALL BITS: Disables (shuts off) the clock
#define F280X_PCLKCR_CLK_ON                      ( 0x01 ) // ALL BITS: Enables (turns on) the clock

//
// WDT Control Register (WDCR)
//
#define F280X_WDCR_WDT_RST_FLAG_CLR              ( 1 << XT_BITPOS7 ) // clears WDT reset flag
#define F280X_WDCR_WDT_ENABLE_TOGGLE             ( 1 << XT_BITPOS6 ) // disables the WDT
#define F280X_WDCR_WDT_EN                        ( 0 << XT_BITPOS6 ) // enables the WDT

// this value must be written to this field anytime that a write is made to this register
// otherwise the system explodes! well not really, it just resets if the WD is enabled
#define F280X_WDCR_WRITE_OR_DIE                  ( 5 << XT_BITPOS3 )

// these bits configure the watchdog counter clock (WDCLK) rate relative to OSCCLK/512
#define F280X_WDCR_WDCLK_OSCCLK_DIV_1            ( 1 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_2            ( 2 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_4            ( 3 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_8            ( 4 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_16           ( 5 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_32           ( 6 << XT_BITPOS0 )
#define F280X_WDCR_WDCLK_OSCCLK_DIV_64           ( 7 << XT_BITPOS0 )

