jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// set up bit field for Watch Dog Control Register (WDCR)
#define F280X_mWDCR_INIT  ( F280X_WDCR_WDT_RST_FLAG_CLR    \
                    | F280X_WDCR_WDT_ENABLE_TOGGLE        \
                    | F280X_WDCR_WRITE_OR_DIE             \
                    | F280X_WDCR_WDCLK_OSCCLK_DIV_64      \
                    )

//
// High/Low Speed Peripheral Clock Prescalar Register (LOSPCP/HISPCP)
//
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_1      ( 0x00 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_2      ( 0x01 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_4      ( 0x02 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_6      ( 0x03 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_8      ( 0x04 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_10     ( 0x05 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_12     ( 0x06 )
#define F280X_XXSPCP_XXPCLK_SYSCLKOUT_DIV_14     ( 0x07 )

//
// System Control and Status Register (SCSR)
//
#define F280X_SCSR_WDINTS                        ( XT_BITPOS2 ) // WDT INT Status
#define F280X_SCSR_WDENINT                       ( XT_BITPOS1 ) // WDT INT enable
#define F280X_SCSR_WDOVERRIDE                    ( XT_BITPOS0 ) // WDT Override

#define F280X_SCSR_WDENINT_INT                   ( 1 << F280X_SCSR_WDENINT )    // WDT INT out enabled
#define F280X_SCSR_WDENINT_RST                   ( 0 << F280X_SCSR_WDENINT )    // WDT RST out enabled
#define F280X_SCSR_WDOVERRIDE_TOG                ( 1 << F280X_SCSR_WDOVERRIDE ) // WDT Override bit Toggle

// since the reset state of WDOVERRIDE is 1, and since writing a 1 to that bit
// will toggle it and thus disallow us access to the hardware WDT disable, we
// must only set the choice of output for the watchdog output.
#define F280X_mSCSR_INIT                         ( F280X_SCSR_WDENINT_RST )

//
// Low-power Mode Register 0 (LPMCR0)
//
#define F280X_LPMCR0_LPM_LPM_IDLE                ( 0x00 )
#define F280X_LPMCR0_LPM_LPM_STANDBY             ( 0x01 )
#define F280X_LPMCR0_LPM_LPM_HALT                ( 0x02 )

//
// Low-power Mode Register 1 (LPMCR1)
//
#define F280X_LPMCR1_NO_STANDBY_INTS             ( 0x00 )

//
// Event Manager - General Purpose Timer Control Register (GTPCONA/GPTCONB)
//
#define F280X_GPTCONX_TXCTRIPE_DIS               ( 0x00 )
#define F280X_GPTCONX_TXCTRIPE_EN                ( 0x01 )
#define F280X_GPTCONX_TXTOADC_DIS                ( 0x00 )
#define F280X_GPTCONX_TXTOADC_UND_INT            ( 0x01 )
#define F280X_GPTCONX_TXTOADC_PER_INT            ( 0x02 )
#define F280X_GPTCONX_TXTOADC_CMP_INT            ( 0x03 )
#define F280X_GPTCONX_TCMPOE_HI_Z                ( 0x00 )
#define F280X_GPTCONX_TCMPOE_TMR_DRVN            ( 0x01 )
#define F280X_GPTCONX_TCMPOE_FORCE_LOW           ( 0x00 )
#define F280X_GPTCONX_TCMPOE_ACTV_LOW            ( 0x01 )
#define F280X_GPTCONX_TCMPOE_ACTV_HI             ( 0x02 )
#define F280X_GPTCONX_TCMPOE_FORCE_HI            ( 0x03 )

//
// Event Manager - Timer X Control Register (T1CON/T2CON/T3CON/T4CON)
//
#define F280X_TXCON_TENABLE_FALSE                ( 0x00 )
#define F280X_TXCON_TENABLE_TRUE                 ( 0x01 )

//
// Compare X Control Register (CONCOMA/CONCOMB)
//
#define F280X_COMCONX_CENABLE_FALSE              ( 0x00 )
#define F280X_COMCONX_CENABLE_TRUE               ( 0x01 )

//
// Dead Band Timer X Register - (DBTCONA/DBTCONB)
//
#define F280X_DBTCONX_DBT_DIS                    ( 0x00 )
#define F280X_DBTCONX_DBT_EN                     ( 0x01 )

//
// Capture X Control Register (CAPCONA/CAPCONB)
//
#define F280X_CAPCONX_CAP_1_2_DIS                ( 0x00 )
#define F280X_CAPCONX_CAP_1_2_EN                 ( 0x01 )
#define F280X_CAPCONX_CAP_3_DIS                  ( 0x00 )
#define F280X_CAPCONX_CAP_3_EN                   ( 0x01 )

//
// Extension Control Register (EXTCONA)
//
#define F280X_EXTCONA_ADC_SOC_DIS                ( 0x00 )
#define F280X_EXTCONA_ADC_SOC_EN                 ( 0x01 )
#define F280X_EXTCONA_CMP_IND_DIS                ( 0x00 )

//
// Peripheral Interrupt Expansion Interrupt Enable Register (PIEIER1 - PIEIER12)
//
#define F280X_PIEIERX_INT_DIS                    ( 0x00 )
#define F280X_PIEIERX_INT_EN                     ( 0xFF )

//
// Peripheral Interrupt Expansion Interrupt Flag Register (PIEIFR1 - PIEIFR12)
//
#define F280X_PIEIFRX_INT_FLG_CLR                ( 0x00 )

//
// Peripheral Interrupt Expansion Control Register (PIECTRL)
//
#define F280X_PIECTRL_ENPIE_FALSE                ( 0x00 )
#define F280X_PIECTRL_ENPIE_TRUE                 ( 0x01 )

//
// Interrupt Flag Register (IFR)
//
#define F280X_IFR_CLR_ALL_FLG                    ( 0x00 )

//
// Interrupt Enable Register (IER)
//
#define F280X_IER_INT_ALL_DIS                    ( 0x00 )

//
// External Interrupt Register (XINT1CR/XINT2CR)
//
#define F280X_XINTXCR_INT_DIS                    ( 0x00 )
#define F280X_XINTXCR_INT_EN                     ( 0x01 )



//
// ADC Control Register Defines (ADCTRL1)
//
#define F280X_ADCTRL1_SEQCASC_NFO                F280X_mNFO(  4,  1 )
#define F280X_ADCTRL1_SEQOVRD_NFO                F280X_mNFO(  5,  1 )
#define F280X_ADCTRL1_CONTRUN_NFO                F280X_mNFO(  6,  1 )
#define F280X_ADCTRL1_CPS_NFO                    F280X_mNFO(  7,  1 )
#define F280X_ADCTRL1_ACQPS_NFO                  F280X_mNFO(  8,  4 )
#define F280X_ADCTRL1_SUSMOD_NFO                 F280X_mNFO(  12, 2 )
#define F280X_ADCTRL1_RESET_NFO                  F280X_mNFO(  14, 1 )

#define F280X_ADCTRL1_SEQCASC_DUAL               ( 0 )
#define F280X_ADCTRL1_SEQCASC_CASC               ( 1 )
#define F280X_ADCTRL1_SEQOVRD_DIS                ( 0 )
#define F280X_ADCTRL1_SEQOVRD_ENA                ( 1 )
#define F280X_ADCTRL1_CONTRUN_START_STOP         ( 0 )
#define F280X_ADCTRL1_CONTRUN_CONT_CONV          ( 1 )
#define F280X_ADCTRL1_CPS_DIVBY_1                ( 0 )
#define F280X_ADCTRL1_CPS_DIVBY_2                ( 1 )
#define F280X_ADCTRL1_ACQPS_WIDTH_1              ( 0 )
#define F280X_ADCTRL1_ACQPS_WIDTH_2              ( 1 )
#define F280X_ADCTRL1_ACQPS_WIDTH_3              ( 2 )
#define F280X_ADCTRL1_ACQPS_WIDTH_4              ( 3 )
#define F280X_ADCTRL1_ACQPS_WIDTH_5              ( 4 )
#define F280X_ADCTRL1_ACQPS_WIDTH_6              ( 5 )
#define F280X_ADCTRL1_ACQPS_WIDTH_7              ( 6 )
#define F280X_ADCTRL1_ACQPS_WIDTH_8              ( 7 )
#define F280X_ADCTRL1_ACQPS_WIDTH_9              ( 8 )
#define F280X_ADCTRL1_ACQPS_WIDTH_10             ( 9 )
#define F280X_ADCTRL1_ACQPS_WIDTH_11             ( 10 )
#define F280X_ADCTRL1_ACQPS_WIDTH_12             ( 11 )
#define F280X_ADCTRL1_ACQPS_WIDTH_13             ( 12 )
#define F280X_ADCTRL1_ACQPS_WIDTH_14             ( 13 )
#define F280X_ADCTRL1_ACQPS_WIDTH_15             ( 14 )
#define F280X_ADCTRL1_ACQPS_WIDTH_16             ( 15 )
#define F280X_ADCTRL1_SUSMOD_MODE_0              ( 0 )
#define F280X_ADCTRL1_SUSMOD_MODE_1              ( 1 )
#define F280X_ADCTRL1_SUSMOD_MODE_2              ( 2 )
#define F280X_ADCTRL1_SUSMOD_MODE_3              ( 3 )
#define F280X_ADCTRL1_RESET_ALL                  ( 1 )

//
// ADC Control Register Defines (ADCTRL2)
//    
#define F280X_ADCTRL2_EPWMSOCBSEQ2_NFO           F280X_mNFO(  0,  1 )
#define F280X_ADCTRL2_INTMODSEQ2_NFO             F280X_mNFO(  2,  1 )
#define F280X_ADCTRL2_INTENASEQ2_NFO             F280X_mNFO(  3,  1 )
#define F280X_ADCTRL2_SOCSEQ2_NFO                F280X_mNFO(  5,  1 )
#define F280X_ADCTRL2_RSTSEQ2_NFO                F280X_mNFO(  6,  1 )
#define F280X_ADCTRL2_EXTSOCSEQ1_NFO             F280X_mNFO(  7,  1 )
#define F280X_ADCTRL2_EPWMSOCASEQ1_NFO           F280X_mNFO(  8,  1 )
#define F280X_ADCTRL2_INTMODSEQ1_NFO             F280X_mNFO(  10, 1 )
#define F280X_ADCTRL2_INTENASEQ1_NFO             F280X_mNFO(  11, 1 )
#define F280X_ADCTRL2_SOCSEQ1_NFO                F280X_mNFO(  13, 1 )
#define F280X_ADCTRL2_RSTSEQ1_NFO                F280X_mNFO(  14, 1 )
#define F280X_ADCTRL2_EPWMSOCBSEQ_NFO            F280X_mNFO(  15, 1 )

#define F280X_ADCTRL2_EPWMSOCBSEQ2_DIS           ( 0 )
#define F280X_ADCTRL2_EPWMSOCBSEQ2_ENA           ( 1 )
#define F280X_ADCTRL2_INTMODSEQ2_EVERY           ( 0 )
#define F280X_ADCTRL2_INTMODSEQ2_EVERY_OTHER     ( 1 )
#define F280X_ADCTRL2_INTENASEQ2_DIS             ( 0 ) 
#define F280X_ADCTRL2_INTENASEQ2_ENA             ( 1 )
#define F280X_ADCTRL2_SOCSEQ2_CLR                ( 0 )
#define F280X_ADCTRL2_SOCSEQ2_START              ( 1 )
#define F280X_ADCTRL2_RSTSEQ2_NO_ACT             ( 0 )
#define F280X_ADCTRL2_RSTSEQ2_RST                ( 1 )
#define F280X_ADCTRL2_EXTSOCSEQ1_DIS             ( 0 )
#define F280X_ADCTRL2_EXTSOCSEQ1_ENA             ( 1 )
#define F280X_ADCTRL2_EPWMSOCASEQ1_DIS           ( 0 )
#define F280X_ADCTRL2_EPWMSOCASEQ1_ENA           ( 1 )
#define F280X_ADCTRL2_INTMODSEQ1_EVERY           ( 0 )
#define F280X_ADCTRL2_INTMODSEQ1_EVERY_OTHER     ( 1 )
#define F280X_ADCTRL2_INTENASEQ1_DIS             ( 0 )
#define F280X_ADCTRL2_INTENASEQ1_ENA             ( 1 )
#define F280X_ADCTRL2_SOCSEQ1_CLR                ( 0 )
#define F280X_ADCTRL2_SOCSEQ1_START              ( 1 )
#define F280X_ADCTRL2_RSTSEQ1_NO_ACT             ( 0 )
#define F280X_ADCTRL2_RSTSEQ1_RST                ( 1 )
#define F280X_ADCTRL2_EPWMSOCBSEQ_DIS            ( 0 )
#define F280X_ADCTRL2_EPWMSOCBSEQ_ENA            ( 1 )

//
// ADC Control Register Defines (ADCTRL3)
//
#define F280X_ADCTRL3_SMODESEL_NFO               F280X_mNFO( 0, 1 )
#define F280X_ADCTRL3_ADCCLKPS_NFO               F280X_mNFO( 1, 4 )
#define F280X_ADCTRL3_ADCPWDN_NFO                F280X_mNFO( 5, 1 )
#define F280X_ADCTRL3_ADCBGRFDN_NFO              F280X_mNFO( 6, 2 )

#define F280X_ADCTRL3_SMODESEL_SEQ_SAMPLE        ( 0  )
#define F280X_ADCTRL3_SMODESEL_SIMUL_SAMPLE      ( 1  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_1           ( 0  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_2           ( 1  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_4           ( 2  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_6           ( 3  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_8           ( 4  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_10          ( 5  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_12          ( 6  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_14          ( 7  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_16          ( 8  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_18          ( 9  )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_20          ( 10 )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_22          ( 11 )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_24          ( 12 )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_26          ( 13 )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_28          ( 14 )
#define F280X_ADCTRL3_ADCCLKPS_DIVBY_30          ( 15 )
#define F280X_ADCTRL3_ADCPWDN_PWR_OFF            ( 0  )
#define F280X_ADCTRL3_ADCPWDN_PWR_ON             ( 1  )
#define F280X_ADCTRL3_ADCBGRFDN_PWR_OFF          ( 0  )
#define F280X_ADCTRL3_ADCBGRFDN_PWR_ON           ( 3  )


//
// ADC Maximum Conversion Channels Register Defines (ADCMAXCONV)
//
#define F280X_ADCMAXCONV_MAXCONV1_NFO            F280X_mNFO( 0, 4 )
#define F280X_ADCMAXCONV_MAXCONV2_NFO            F280X_mNFO( 4, 3 )

#define F280X_ADCMAXCONV_MAXCONV1_CONV_1        ( 0  )           
#define F280X_ADCMAXCONV_MAXCONV1_CONV_2        ( 1  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_3        ( 2  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_4        ( 3  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_5        ( 4  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_6        ( 5  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_7        ( 6  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_8        ( 7  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_9        ( 8  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_10       ( 9  )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_11       ( 10 )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_12       ( 11 )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_13       ( 12 )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_14       ( 13 )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_15       ( 14 )
#define F280X_ADCMAXCONV_MAXCONV1_CONV_16       ( 15 )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_1        ( 0  )           
#define F280X_ADCMAXCONV_MAXCONV2_CONV_2        ( 1  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_3        ( 2  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_4        ( 3  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_5        ( 4  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_6        ( 5  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_7        ( 6  )
#define F280X_ADCMAXCONV_MAXCONV2_CONV_8        ( 7  )

//
// ADC Reference Select Register Defines (ADCREFSEL)
//
#define F280X_ADCREFSEL_REFSEL_NFO              F280X_mNFO( 14, 2 )

#define F280X_ADCREFSEL_REFSEL_INTERNAL         ( 0 )
#define F280X_ADCREFSEL_REFSEL_EXTERNAL         ( 1 )


//
// Serial Communication Interface Registers ( SCIA/SCIB )
//
//SCICCR
#define F280X_SCICCR_STOP_BITS_ONE               ( 0 )  // Read/Write
#define F280X_SCICCR_STOP_BITS_TWO               ( 1 )
#define F280X_SCICCR_STOP_BITS_BITPOS            ( XT_BITPOS7 )

#define F280X_SCICCR_PARITY_ODD                  ( 0 )  // Read/Write
#define F280X_SCICCR_PARITY_EVEN                 ( 1 )
#define F280X_SCICCR_PARITY_BITPOS               ( XT_BITPOS6 )

#define F280X_SCICCR_PARITY_ENA_DIS              ( 0 )  // Read/Write
#define F280X_SCICCR_PARITY_ENA_EN               ( 1 )
#define F280X_SCICCR_PARITY_ENA_BITPOS           ( XT_BITPOS5 )

#define F280X_SCICCR_LOOPBACK_DIS                ( 0 )  // Read/Write
#define F280X_SCICCR_LOOPBACK_EN                 ( 1 )
#define F280X_SCICCR_LOOPBACK_BITPOS             ( XT_BITPOS4 )

