jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
#define F280X_SCICCR_MULTIPRO_MODE_IDLELINE      ( 0 )  // Read/Write
#define F280X_SCICCR_MULTIPRO_MODE_ADDRBIT       ( 1 )
#define F280X_SCICCR_MULTIPRO_MODE_BITPOS        ( XT_BITPOS3 )

#define F280X_SCICCR_CHARLEN_1                   ( 0 )  // Read/Write
#define F280X_SCICCR_CHARLEN_2                   ( 1 )
#define F280X_SCICCR_CHARLEN_3                   ( 2 )
#define F280X_SCICCR_CHARLEN_4                   ( 3 )
#define F280X_SCICCR_CHARLEN_5                   ( 4 )
#define F280X_SCICCR_CHARLEN_6                   ( 5 )
#define F280X_SCICCR_CHARLEN_7                   ( 6 )
#define F280X_SCICCR_CHARLEN_8                   ( 7 )
#define F280X_SCICCR_CHARLEN_BITPOS              ( XT_BITPOS0 )

// SCICTL1
#define F280X_SCICTL1_RX_ERR_INT_DIS             ( 0 )  // Read/Write
#define F280X_SCICTL1_RX_ERR_INT_EN              ( 1 )
#define F280X_SCICTL1_RX_ERR_INT_BITPOS          ( XT_BITPOS6 )

#define F280X_SCICTL1_SW_RESET_ASSERT            ( 0 )  // Read/Write
#define F280X_SCICTL1_SW_RESET_DEASSERT          ( 1 )
#define F280X_SCICTL1_SW_RESET_BITPOS            ( XT_BITPOS5 )

#define F280X_SCICTL1_TX_WAKE_DIS                ( 0 )  // Read/Write
#define F280X_SCICTL1_TX_WAKE_EN                 ( 1 )
#define F280X_SCICTL1_TX_WAKE_BITPOS             ( XT_BITPOS3 )

#define F280X_SCICTL1_SLEEP_DIS                  ( 0 )  // Read/Write
#define F280X_SCICTL1_SLEEP_EN                   ( 1 )
#define F280X_SCICTL1_SLEEP_BITPOS               ( XT_BITPOS2 )

#define F280X_SCICTL1_TX_DIS                     ( 0 )  // Read/Write
#define F280X_SCICTL1_TX_EN                      ( 1 )
#define F280X_SCICTL1_TX_BITPOS                  ( XT_BITPOS1 )

#define F280X_SCICTL1_RX_DIS                     ( 0 )  // Read/Write
#define F280X_SCICTL1_RX_EN                      ( 1 )
#define F280X_SCICTL1_RX_BITPOS                  ( XT_BITPOS0 )

// SCICTL2
#define F280X_SCICTL2_TXRDY_FLAG_IS_CLR          ( 0 )  // Read only
#define F280X_SCICTL2_TXRDY_FLAG_IS_SET          ( 1 )
#define F280X_SCICTL2_TXRDY_FLAG_BITPOS          ( XT_BITPOS7 )

#define F280X_SCICTL2_TX_EMPTY_FLAG_IS_CLR       ( 0 )  // Read only
#define F280X_SCICTL2_TX_EMPTY_FLAG_IS_SET       ( 1 )
#define F280X_SCICTL2_TX_EMPTY_FLAG_BITPOS       ( XT_BITPOS6 )

#define F280X_SCICTL2_RXBK_INT_DIS               ( 0 )  // Read/Write
#define F280X_SCICTL2_RXBK_INT_EN                ( 1 )
#define F280X_SCICTL2_RXBK_INT_BITPOS            ( XT_BITPOS1 )

#define F280X_SCICTL2_TXRDY_INT_DIS              ( 0 )  // Read/Write
#define F280X_SCICTL2_TXRDY_INT_EN               ( 1 )
#define F280X_SCICTL2_TXRDY_INT_BITPOS           ( XT_BITPOS0 )

// SCIRXST
#define F280X_SCIRXST_RX_ERROR_FLAG_IS_CLR       ( 0 )  // Read only
#define F280X_SCIRXST_RX_ERROR_FLAG_IS_SET       ( 1 )
#define F280X_SCIRXST_RX_ERROR_FLAG_BITPOS       ( XT_BITPOS7 )

#define F280X_SCIRXST_RX_RDY_FLAG_IS_CLR         ( 0 )  // Read only
#define F280X_SCIRXST_RX_RDY_FLAG_IS_SET         ( 1 )
#define F280X_SCIRXST_RX_RDY_FLAG_BITPOS         ( XT_BITPOS6 )

#define F280X_SCIRXST_BRKDT_FLAG_IS_CLR          ( 0 )  // Read only
#define F280X_SCIRXST_BRKDT_FLAG_IS_SET          ( 1 )
#define F280X_SCIRXST_BRKDT_FLAG_BITPOS          ( XT_BITPOS5 )

#define F280X_SCIRXST_FRAME_ERR_FLAG_IS_CLR      ( 0 )  // Read only
#define F280X_SCIRXST_FRAME_ERR_FLAG_IS_SET      ( 1 )
#define F280X_SCIRXST_FRAME_ERR_FLAG_BITPOS      ( XT_BITPOS4 )

#define F280X_SCIRXST_OVERRUN_ERR_FLAG_IS_CLR    ( 0 )  // Read only
#define F280X_SCIRXST_OVERRUN_ERR_FLAG_IS_SET    ( 1 )
#define F280X_SCIRXST_OVERRUN_ERR_FLAG_BITPOS    ( XT_BITPOS3 )

#define F280X_SCIRXST_PARITY_ERR_FLAG_IS_CLR     ( 0 )  // Read only
#define F280X_SCIRXST_PARITY_ERR_FLAG_IS_SET     ( 1 )
#define F280X_SCIRXST_PARITY_ERR_FLAG_BITPOS     ( XT_BITPOS2 )

#define F280X_SCIRXST_RX_WAKE_FLAG_IS_CLR        ( 0 )  // Read only
#define F280X_SCIRXST_RX_WAKE_FLAG_IS_SET        ( 1 )
#define F280X_SCIRXST_RX_WAKE_FLAG_BITPOS        ( XT_BITPOS1 )

// SCIFFTX
#define F280X_SCIFFTX_TXRX_CHAN_RESET            ( 0 )  // Read/Write
#define F280X_SCIFFTX_TXRX_CHAN_RESUME           ( 1 )
#define F280X_SCIFFTX_TXRX_CHAN_BITPOS           ( XT_BITPOS15 )
#define F280X_SCIFFTX_TXRX_FIFO_DIS              ( 0 )  // Read/Write
#define F280X_SCIFFTX_TXRX_FIFO_EN               ( 1 )
#define F280X_SCIFFTX_TXRX_FIFO_BITPOS           ( XT_BITPOS14 )

#define F280X_SCIFFTX_TX_FIFO_PTR_RESET          ( 0 )  // Read/Write
#define F280X_SCIFFTX_TX_FIFO_PTR_REEN           ( 1 )
#define F280X_SCIFFTX_TX_FIFO_PTR_BITPOS         ( XT_BITPOS13 )

#define F280X_SCIFFTX_TX_FIFO_FLAG_IS_CLR        ( 0 )  // Read only
#define F280X_SCIFFTX_TX_FIFO_FLAG_IS_SET        ( 1 )
#define F280X_SCIFFTX_TX_FIFO_FLAG_BITPOS        ( XT_BITPOS7 )

#define F280X_SCIFFTX_CLEAR_TX_FIFO_INT_FLAG     ( 1 )  // Write only
#define F280X_SCIFFTX_CLEAR_TX_FIFO_INT_BITPOS   ( XT_BITPOS6 )

#define F280X_SCIFFTX_TX_FIFO_INT_DIS            ( 0 )  // Read/Write
#define F280X_SCIFFTX_TX_FIFO_INT_EN             ( 1 )
#define F280X_SCIFFTX_TX_FIFO_INT_BITPOS         ( XT_BITPOS5 )

#define F280X_SCIFFTX_TX_FIFO_INTLVL_0           ( 0 )  // Read/Write
#define F280X_SCIFFTX_TX_FIFO_INTLVL_1           ( 1 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_2           ( 2 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_3           ( 3 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_4           ( 4 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_5           ( 5 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_6           ( 6 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_7           ( 7 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_8           ( 8 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_9           ( 9 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_10          ( 10 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_11          ( 11 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_12          ( 12 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_13          ( 13 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_14          ( 14 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_15          ( 15 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_16          ( 16 )
#define F280X_SCIFFTX_TX_FIFO_INTLVL_BITPOS      ( XT_BITPOS0 )

