jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// SCIFFRX
#define F280X_SCIFFRX_RX_FIFO_OVF_FLAG_IS_CLR    ( 0 )  // Read only
#define F280X_SCIFFRX_RX_FIFO_OVF_FLAG_IS_SET    ( 1 )
#define F280X_SCIFFRX_RX_FIFO_OVF_FLAG_BITPOS    ( XT_BITPOS15 )

#define F280X_SCIFFRX_CLEAR_RX_FIFO_OVF_FLAG     ( 1 )  // Write only
#define F280X_SCIFFRX_CLEAR_RX_FIFO_OVF_BITPOS   ( XT_BITPOS14)

#define F280X_SCIFFRX_RX_FIFO_PTR_RESET          ( 0 )  // Read/Write
#define F280X_SCIFFRX_RX_FIFO_PTR_REEN           ( 1 )
#define F280X_SCIFFRX_RX_FIFO_PTR_BITPOS         ( XT_BITPOS13 )

#define F280X_SCIFFRX_RX_FIFO_INT_FLAG_IS_CLR    ( 0 )  // Read only
#define F280X_SCIFFRX_RX_FIFO_INT_FLAG_IS_SET    ( 1 )
#define F280X_SCIFFRX_RX_FIFO_INT_FLAG_BITPOS    ( XT_BITPOS7 )

#define F280X_SCIFFRX_CLEAR_RX_FIFO_INT_FLAG     ( 1 )  // Write only
#define F280X_SCIFFRX_CLEAR_RX_FIFO_INT_BITPOS   ( XT_BITPOS6 )

#define F280X_SCIFFRX_RX_FIFO_INT_DIS            ( 0 )  // Read/Write
#define F280X_SCIFFRX_RX_FIFO_INT_EN             ( 1 )
#define F280X_SCIFFRX_RX_FIFO_INT_BITPOS         ( XT_BITPOS5 )

#define F280X_SCIFFRX_RX_FIFO_INTLVL_0           ( 0 )  // Read/Write
#define F280X_SCIFFRX_RX_FIFO_INTLVL_1           ( 1 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_2           ( 2 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_3           ( 3 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_4           ( 4 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_5           ( 5 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_6           ( 6 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_7           ( 7 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_8           ( 8 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_9           ( 9 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_10          ( 10 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_11          ( 11 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_12          ( 12 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_13          ( 13 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_14          ( 14 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_15          ( 15 )
#define F280X_SCIFFRX_TX_FIFO_INTLVL_16          ( 16 )
#define F280X_SCIFFRX_RX_FIFO_INTLVL_BITPOS      ( XT_BITPOS0 )

// SCIRXBUF
#define F280X_SCIRXBUF_SCIFFFE_IS_CLR             ( 0 )  // Read only
#define F280X_SCIRXBUF_SCIFFFE_IS_SET             ( 1 )
#define F280X_SCIRXBUF_SCIFFPE_IS_CLR             ( 0 )  // Read only
#define F280X_SCIRXBUF_SCIFFPE_IS_SET             ( 1 )

// SCIFFCT
#define F280X_SCIFFCT_ABD_FLAG_IS_CLR            ( 0 )  // Read only
#define F280X_SCIFFCT_ABD_FLAG_IS_SET            ( 1 )
#define F280X_SCIFFCT_ABD_FLAG_BITPOS            ( XT_BITPOS15 )

#define F280X_SCIFFCT_CLEAR_ABD_FLAG             ( 1 )  // Write only
#define F280X_SCIFFCT_CLEAR_ABD_BITPOS           ( XT_BITPOS14 )

#define F280X_SCIFFCT_CDC_DIS                    ( 0 )  // Read/Write
#define F280X_SCIFFCT_CDC_EN                     ( 1 )
#define F280X_SCIFFCT_CDC_BITPOS                 ( XT_BITPOS13 )

#define F280X_SCIFFCT_FIFO_DLY_BIT0              ( 0x01 )  // Read/Write
#define F280X_SCIFFCT_FIFO_DLY_BIT1              ( 0x02 )
#define F280X_SCIFFCT_FIFO_DLY_BIT2              ( 0x04 )
#define F280X_SCIFFCT_FIFO_DLY_BIT3              ( 0x08 )
#define F280X_SCIFFCT_FIFO_DLY_BIT4              ( 0x10 )
#define F280X_SCIFFCT_FIFO_DLY_BIT5              ( 0x20 )
#define F280X_SCIFFCT_FIFO_DLY_BIT6              ( 0x40 )
#define F280X_SCIFFCT_FIFO_DLY_BIT7              ( 0x80 )

// SCIPRI
#define F280X_SCIPRI_SUSMODE_STOP                ( 0 )     // Read/Write
#define F280X_SCIPRI_SUSMODE_FREE                ( 1 )
#define F280X_SCIPRI_SUSMODE_SOFT                ( 2 )
#define F280X_SCIPRI_SUSMODE_BITPOS              ( XT_BITPOS3 )

// EV timer interrupt masks
#define F280X_PIE_T1PINT_MASK    ( 0x08 )
#define F280X_PIE_T1CINT_MASK    ( 0x10 )
#define F280X_PIE_T1UFINT_MASK   ( 0x20 )
#define F280X_PIE_T1OFINT_MASK   ( 0x40 )
#define F280X_PIE_T2PINT_MASK    ( 0x01 )
#define F280X_PIE_T2CINT_MASK    ( 0x02 )
#define F280X_PIE_T2UFINT_MASK   ( 0x04 )
#define F280X_PIE_T2OFINT_MASK   ( 0x08 )
#define F280X_PIE_T3PINT_MASK    ( 0x08 )
#define F280X_PIE_T3CINT_MASK    ( 0x10 )
#define F280X_PIE_T3UFINT_MASK   ( 0x20 )
#define F280X_PIE_T3OFINT_MASK   ( 0x40 )
#define F280X_PIE_T4PINT_MASK    ( 0x01 )
#define F280X_PIE_T4CINT_MASK    ( 0x02 )
#define F280X_PIE_T4UFINT_MASK   ( 0x04 )
#define F280X_PIE_T4OFINT_MASK   ( 0x08 )
#define F280X_PIE_T1_ALL_MASK    ( 0x78 )
#define F280X_PIE_T2_ALL_MASK    ( 0x0F )
#define F280X_PIE_T3_ALL_MASK    ( 0x78 )
#define F280X_PIE_T4_ALL_MASK    ( 0x0F )

// global interrupt enable register (IER) - timer bit
#define F280X_IER_INT2_ENA        ( XT_BIT1 )
#define F280X_IER_INT3_ENA        ( XT_BIT2 )
#define F280X_IER_INT4_ENA        ( XT_BIT3 )
#define F280X_IER_INT5_ENA        ( XT_BIT4 )

// gpio direction control register bits for timer compare output
#define F280X_GPADIR_T1DIR_OUTPUT    ( XT_BIT6 )
#define F280X_GPADIR_T2DIR_OUTPUT    ( XT_BIT7 )
#define F280X_GPBDIR_T3DIR_OUTPUT    ( XT_BIT6 )
#define F280X_GPBDIR_T4DIR_OUTPUT    ( XT_BIT7 )

// GP timer interrupt flag bits
// need to be shifted the correct number of bits to match EV and timer number
#define F280X_EVXIFR_NO_INT          ( 0 )
#define F280X_EVXIFR_TXPINT          ( 1 << XT_BITPOS0 )
#define F280X_EVXIFR_TXCINT          ( 1 << XT_BITPOS1 )
#define F280X_EVXIFR_TXUFINT         ( 1 << XT_BITPOS2 )
#define F280X_EVXIFR_TXOFINT         ( 1 << XT_BITPOS3 )

#define F280X_EVAIFRA_T1PINT          ( 1 << XT_BITPOS7 )
#define F280X_EVAIFRA_T1CINT          ( 1 << XT_BITPOS8 )
#define F280X_EVAIFRA_T1UFINT         ( 1 << XT_BITPOS9 )
#define F280X_EVAIFRA_T1OFINT         ( 1 << XT_BITPOS10 )

#define F280X_EVAIFRB_T2PINT          ( 1 << XT_BITPOS0 )
#define F280X_EVAIFRB_T2CINT          ( 1 << XT_BITPOS1 )
#define F280X_EVAIFRB_T2UFINT         ( 1 << XT_BITPOS2 )
#define F280X_EVAIFRB_T2OFINT         ( 1 << XT_BITPOS3 )

#define F280X_EVBIFRA_T3PINT          ( 1 << XT_BITPOS7 )
#define F280X_EVBIFRA_T3CINT          ( 1 << XT_BITPOS8 )
#define F280X_EVBIFRA_T3UFINT         ( 1 << XT_BITPOS9 )
#define F280X_EVBIFRA_T3OFINT         ( 1 << XT_BITPOS10 )

