jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
#define F280X_EVBIFRB_T4PINT          ( 1 << XT_BITPOS0 )
#define F280X_EVBIFRB_T4CINT          ( 1 << XT_BITPOS1 )
#define F280X_EVBIFRB_T4UFINT         ( 1 << XT_BITPOS2 )
#define F280X_EVBIFRB_T4OFINT         ( 1 << XT_BITPOS3 )

// GP timer control reg A masks
// GP timer conrol reg A masks
#define F280X_GPTCONA_T1TOADC_MSK    ( XT_BIT7 & XT_BIT8 )
#define F280X_GPTCONA_T2TOADC_MSK    ( XT_BIT9 & XT_BIT10 )
#define F280X_GPTCONB_T3TOADC_MSK    ( XT_BIT7 & XT_BIT8 )
#define F280X_GPTCONB_T4TOADC_MSK    ( XT_BIT9 & XT_BIT10 )

// GP timer compare output polarity bit masks
#define F280X_GPTCONA_T1PIN_MSK      ( XT_BIT0 & XT_BIT1 )
#define F280X_GPTCONA_T2PIN_MSK      ( XT_BIT2 & XT_BIT3 )
#define F280X_GPTCONB_T3PIN_MSK      ( XT_BIT0 & XT_BIT1 )
#define F280X_GPTCONB_T4PIN_MSK      ( XT_BIT2 & XT_BIT3 )

// GP timer control bits
#define F280X_GPTCON_TXTOADC_DISAB    ( 0x0000 )
#define F280X_GPTCON_TXTOADC_COMP     ( XT_BIT0 & XT_BIT1 )
#define F280X_GPTCON_TXTOADC_PRD      ( XT_BIT1 )
#define F280X_GPTCON_TXTOADC_UNDER    ( XT_BIT0 )
#define F280X_GPTCON_TCOMPOE_EN       ( XT_BIT6 )
#define F280X_GPTCON_TXPIN_DISAB      ( 0x0000 )
#define F280X_GPTCON_TXPIN_FRC_LOW    ( 0x0000 )
#define F280X_GPTCON_TXPIN_FRC_HI     ( XT_BIT0 & XT_BIT1 )
#define F280X_GPTCON_TXPIN_ACT_LOW    ( XT_BIT0 )
#define F280X_GPTCON_TXPIN_ACT_HI     ( XT_BIT1 )

// EV timer control bits
#define F280X_TXCON_NO_COMP           ( 0x0000 )
#define F280X_TXCON_ZERO_RELOAD       ( 0x0000 )
#define F280X_TXCON_EQUAL_RELOAD      ( XT_BIT2 )
#define F280X_TXCON_IMM_RELOAD        ( XT_BIT3 )

// EV timer clock source types
#define F280X_TXCON_TCLK_INT          ( 0x0000 )
#define F280X_TXCON_TCLK_EXT          ( XT_BIT4 )
#define F280X_TXCON_TCLK_QEP          ( XT_BIT4 & XT_BIT5 )

// EV timer sync mode bits
#define F280X_TXCON_SYN_MSK           ( XT_BIT7 & XT_BIT0 )
#define F280X_TXCON_SYN_SEP           ( 0x0000 )
#define F280X_TXCON_SYN_PRD           ( XT_BIT0 )
#define F280X_TXCON_SYN_START         ( XT_BIT7 )
#define F280X_TXCON_SYN_PRDST         ( XT_BIT7 & XT_BIT0 )

// GP timer control masks
// Added HM - Nov 19, 2004
#define F280X_TXCON_EMMCTRL_MSK  ( XT_BIT14 & XT_BIT15 )//Emulation Control
#define F280X_TXCON_TMODE_MSK    ( XT_BIT11 & XT_BIT12 )//Count Mode
#define F280X_TXCON_TPS_MSK      ( XT_BIT8 & XT_BIT9 & XT_BIT10 )//Clk Prescaler
#define F280X_TXCON_TXSWTX_MSK   ( XT_BIT7 )//Timer start
#define F280X_TXCON_TENABLE_MASK ( XT_BIT6 )//Timer Enable
#define F280X_TXCON_TCLKS_MSK    ( XT_BIT4 & XT_BIT5 )//Clock Source Select
#define F280X_TXCON_TCLD_MSK     ( XT_BIT2 & XT_BIT3 )//Timer Compare Reg Reload
#define F280X_TXCON_TECMPR_MSK   ( XT_BIT1 )//Timer compare enable
#define F280X_TXCON_SELTXPR_MSK  ( XT_BIT0 )//Timer 1 period select

// GP timer emulation control bits
#define F280X_TXCON_EMMCTRL_NO_EFFECT3       ( 0xC000 )
#define F280X_TXCON_EMMCTRL_NO_EFFECT2       ( 0x8000 )
#define F280X_TXCON_EMMCTRL_STOP_PER_COMP    ( 0x4000 )
#define F280X_TXCON_EMMCTRL_STOP_IMMED       ( 0x0000 )

// timer count mode bits (11 & 12)
#define F280X_TXCON_TMODE_CONTUPDOWN  ( XT_BIT11 )                // 0x0800
#define F280X_TXCON_TMODE_CONTUP      ( XT_BIT12 )                // 0x1000
#define F280X_TXCON_TMODE_DIRUPDOWN   ( XT_BIT11 & XT_BIT12 )     // 0x1800
#define F280X_TXCON_TMODE_STOPHOLD    ( 0x0000 )                  // 0x0000

// timer enable bit positions
#define F280X_T1CON_TENABLE_EN    ( XT_BIT6 )
#define F280X_T2CON_TENABLE_EN    ( XT_BIT6 )
#define F280X_T3CON_TENABLE_EN    ( XT_BIT6 )
#define F280X_T4CON_TENABLE_EN    ( XT_BIT6 )

// timer prescaler bits
#define F280X_T1CON_TPS_MSK       ( XT_BIT8 & XT_BIT9 & XT_BIT10 )
#define F280X_T2CON_TPS_MSK       ( XT_BIT8 & XT_BIT9 & XT_BIT10 )
#define F280X_T3CON_TPS_MSK       ( XT_BIT8 & XT_BIT9 & XT_BIT10 )
#define F280X_T4CON_TPS_MSK       ( XT_BIT8 & XT_BIT9 & XT_BIT10 )

// timer prescaler register shift count
#define F280X_T1CON_TPS0          ( XT_BITPOS8 )
#define F280X_T2CON_TPS0          ( XT_BITPOS8 )
#define F280X_T3CON_TPS0          ( XT_BITPOS8 )
#define F280X_T4CON_TPS0          ( XT_BITPOS8 )

//GPIO General
//
#define F280X_GPIO_PIN_DIR_OUTPUT     ( 1 )
#define F280X_GPIO_PIN_DIR_INPUT      ( 0 )

// GPIO A Control Register bit masks
// NOTE: GPADIR, GPADAT, GPASET, GPACLEAR, GPATOGGLE registers have the same bit
// to I/O signal mapping as the GPAMUX
#define F280X_GPAMUX_MSK_PWM1        ( XT_BIT0 )
#define F280X_GPAMUX_MSK_PWM2        ( XT_BIT1 )
#define F280X_GPAMUX_MSK_PWM3        ( XT_BIT2 )
#define F280X_GPAMUX_MSK_PWM4        ( XT_BIT3 )
#define F280X_GPAMUX_MSK_PWM5        ( XT_BIT4 )
#define F280X_GPAMUX_MSK_PWM6        ( XT_BIT5 )
#define F280X_GPAMUX_MSK_T1PWM_T1CMP ( XT_BIT6 )
#define F280X_GPAMUX_MSK_T2PWM_T2CMP ( XT_BIT7 )
#define F280X_GPAMUX_MSK_CAP1_QEP1   ( XT_BIT8 )
#define F280X_GPAMUX_MSK_CAP2_QEP2   ( XT_BIT9 )
#define F280X_GPAMUX_MSK_CAP3_QEPI1  ( XT_BIT10 )
#define F280X_GPAMUX_MSK_TDIRA       ( XT_BIT11 )
#define F280X_GPAMUX_MSK_TCLKINA     ( XT_BIT12 )
#define F280X_GPAMUX_MSK_C1TRIP      ( XT_BIT13 )
#define F280X_GPAMUX_MSK_C2TRIP      ( XT_BIT14 )
#define F280X_GPAMUX_MSK_C3TRIP      ( XT_BIT15 )

// GPIO B Control Register bit masks
// *NOTE: GPBDIR, GPBDAT, GPBSET, GPBCLEAR, GPBTOGGLE registers have the same bit
// to I/O signal mapping as the GPBMUX (*manual does not explicitly state this)
#define F280X_GPBMUX_MSK_PWM7        ( XT_BIT0 )
#define F280X_GPBMUX_MSK_PWM8        ( XT_BIT1 )
#define F280X_GPBMUX_MSK_PWM9        ( XT_BIT2 )
#define F280X_GPBMUX_MSK_PWM10       ( XT_BIT3 )
#define F280X_GPBMUX_MSK_PWM11       ( XT_BIT4 )
#define F280X_GPBMUX_MSK_PWM12       ( XT_BIT5 )
#define F280X_GPBMUX_MSK_T3PWM_T3CMP ( XT_BIT6 )
#define F280X_GPBMUX_MSK_T4PWM_T4CMP ( XT_BIT7 )
#define F280X_GPBMUX_MSK_CAP4_QEP3   ( XT_BIT8 )
#define F280X_GPBMUX_MSK_CAP5_QEP4   ( XT_BIT9 )
#define F280X_GPBMUX_MSK_CAP6_QEPI2  ( XT_BIT10 )
#define F280X_GPBMUX_MSK_TDIRB       ( XT_BIT11 )
#define F280X_GPBMUX_MSK_TCLKINB     ( XT_BIT12 )
#define F280X_GPBMUX_MSK_C4TRIP      ( XT_BIT13 )
#define F280X_GPBMUX_MSK_C5TRIP      ( XT_BIT14 )
#define F280X_GPBMUX_MSK_C6TRIP      ( XT_BIT15 )

