jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// EVA/B Dead-Band Timer Control Register bit masks (DBTCON)
// NOTE: bits 0 & 1 reserved
#define F280X_DBTCON_MSK_DBTPS0      ( XT_BIT2 )
#define F280X_DBTCON_MSK_DBTPS1      ( XT_BIT3 )
#define F280X_DBTCON_MSK_DBTPS2      ( XT_BIT4 )
#define F280X_DBTCON_MSK_EDBT1       ( XT_BIT5 )
#define F280X_DBTCON_MSK_EDBT2       ( XT_BIT6 )
#define F280X_DBTCON_MSK_EDBT3       ( XT_BIT7 )
#define F280X_DBTCON_MSK_DBT0        ( XT_BIT8 )
#define F280X_DBTCON_MSK_DBT1        ( XT_BIT9 )
#define F280X_DBTCON_MSK_DBT2        ( XT_BIT10 )
#define F280X_DBTCON_MSK_DBT3        ( XT_BIT11 )
// NOTE: bits 12-15 reserved

// EVA/B Dead-Band Timer Control Register bit positions (DBTCON)
// NOTE: bits 0 & 1 reserved
#define F280X_DBTCON_POS_DBTPS0      ( XT_BITPOS2 )
#define F280X_DBTCON_POS_DBTPS1      ( XT_BITPOS3 )
#define F280X_DBTCON_POS_DBTPS2      ( XT_BITPOS4 )
#define F280X_DBTCON_POS_EDBT1       ( XT_BITPOS5 )
#define F280X_DBTCON_POS_EDBT2       ( XT_BITPOS6 )
#define F280X_DBTCON_POS_EDBT3       ( XT_BITPOS7 )
#define F280X_DBTCON_POS_DBT0        ( XT_BITPOS8 )
#define F280X_DBTCON_POS_DBT1        ( XT_BITPOS9 )
#define F280X_DBTCON_POS_DBT2        ( XT_BITPOS10 )
#define F280X_DBTCON_POS_DBT3        ( XT_BITPOS11 )
// NOTE: bits 12-15 reserved

// All Dead-Band Timer enable bits mask
#define F280X_DBTCON_MSK_EDBT        ( 7 << F280X_DBTCON_POS_EDBT1 )
// All Dead-Band Timer prescaler bits mask
#define F280X_DBTCON_MSK_DBTPS       ( 7 << F280X_DBTCON_POS_DBTPS0 )

// Use these defines to configure the DBTCON register
//15 dead-band timer periods
#define F280X_DBTCON_DBT_15          ( 15 << F280X_DBTCON_POS_DBT0 )
//14 dead-band timer periods
#define F280X_DBTCON_DBT_14          ( 14 << F280X_DBTCON_POS_DBT0 )
//13 dead-band timer periods
#define F280X_DBTCON_DBT_13          ( 13 << F280X_DBTCON_POS_DBT0 )
//12 dead-band timer periods
#define F280X_DBTCON_DBT_12          ( 12 << F280X_DBTCON_POS_DBT0 )
//11 dead-band timer periods
#define F280X_DBTCON_DBT_11          ( 11 << F280X_DBTCON_POS_DBT0 )
//10 dead-band timer periods
#define F280X_DBTCON_DBT_10          ( 10 << F280X_DBTCON_POS_DBT0 )
//9 dead-band timer periods
#define F280X_DBTCON_DBT_9           ( 9 << F280X_DBTCON_POS_DBT0 )
//8 dead-band timer periods
#define F280X_DBTCON_DBT_8           ( 8 << F280X_DBTCON_POS_DBT0 )
//7 dead-band timer periods
#define F280X_DBTCON_DBT_7           ( 7 << F280X_DBTCON_POS_DBT0 )
//6 dead-band timer periods
#define F280X_DBTCON_DBT_6           ( 6 << F280X_DBTCON_POS_DBT0 )
//5 dead-band timer periods
#define F280X_DBTCON_DBT_5           ( 5 << F280X_DBTCON_POS_DBT0 )
//4 dead-band timer periods
#define F280X_DBTCON_DBT_4           ( 4 << F280X_DBTCON_POS_DBT0 )
//3 dead-band timer periods
#define F280X_DBTCON_DBT_3           ( 3 << F280X_DBTCON_POS_DBT0 )
//2 dead-band timer periods
#define F280X_DBTCON_DBT_2           ( 2 << F280X_DBTCON_POS_DBT0 )
//1 dead-band timer periods
#define F280X_DBTCON_DBT_1           ( 1 << F280X_DBTCON_POS_DBT0 )
//0 dead-band timer periods
#define F280X_DBTCON_DBT_0           ( 0 << F280X_DBTCON_POS_DBT0 )
//Dead-band tmr 3 en
#define F280X_DBTCON_EDBT3_EN        ( 1 << F280X_DBTCON_POS_EDBT3 )
//Dead-band tmr 3 dis
#define F280X_DBTCON_EDBT3_DIS       ( 0 << F280X_DBTCON_POS_EDBT3 )
//Dead-band tmr 2 en
#define F280X_DBTCON_EDBT2_EN        ( 1 << F280X_DBTCON_POS_EDBT2 )
//Dead-band tmr 2 dis
#define F280X_DBTCON_EDBT2_DIS       ( 0 << F280X_DBTCON_POS_EDBT2 )
//Dead-band tmr 1 en
#define F280X_DBTCON_EDBT1_EN        ( 1 << F280X_DBTCON_POS_EDBT1 )
//Dead-band tmr 1 dis
#define F280X_DBTCON_EDBT1_DIS       ( 0 << F280X_DBTCON_POS_EDBT1 )
//Dead-band timer / 32 prescaler
#define F280X_DBTCON_DBTPS_32        ( 5 << F280X_DBTCON_POS_DBTPS0 )
//Dead-band timer / 16 prescaler
#define F280X_DBTCON_DBTPS_16        ( 4 << F280X_DBTCON_POS_DBTPS0 )
//Dead-band timer / 8 prescaler
#define F280X_DBTCON_DBTPS_8         ( 3 << F280X_DBTCON_POS_DBTPS0 )
//Dead-band timer / 4 prescaler
#define F280X_DBTCON_DBTPS_4         ( 2 << F280X_DBTCON_POS_DBTPS0 )
//Dead-band timer / 2 prescaler
#define F280X_DBTCON_DBTPS_2         ( 1 << F280X_DBTCON_POS_DBTPS0 )
//Dead-band timer / 1 prescaler
#define F280X_DBTCON_DBTPS_1         ( 0 << F280X_DBTCON_POS_DBTPS0 )

// EVA/B Compare Control Register bit masks (COMCON)
#define F280X_COMCON_MSK_C1TRIPE     ( XT_BIT0 )
#define F280X_COMCON_MSK_C2TRIPE     ( XT_BIT1 )
#define F280X_COMCON_MSK_C3TRIPE     ( XT_BIT2 )
// NOTE: bits 3 & 4 reserved
#define F280X_COMCON_MSK_FCMP1OE     ( XT_BIT5 )
#define F280X_COMCON_MSK_FCMP2OE     ( XT_BIT6 )
#define F280X_COMCON_MSK_FCMP3OE     ( XT_BIT7 )
#define F280X_COMCON_MSK_PDPINT      ( XT_BIT8 )
#define F280X_COMCON_MSK_FCMPOE      ( XT_BIT9 )
#define F280X_COMCON_MSK_ACTRLD0     ( XT_BIT10 )
#define F280X_COMCON_MSK_ACTRLD1     ( XT_BIT11 )
#define F280X_COMCON_MSK_SVENABLE    ( XT_BIT12 )
#define F280X_COMCON_MSK_CLD0        ( XT_BIT13 )
#define F280X_COMCON_MSK_CLD1        ( XT_BIT14 )
#define F280X_COMCON_MSK_CENABLE     ( XT_BIT15 )

// EVA/B Compare Control Register bit positions (COMCON)
#define F280X_COMCON_POS_C1TRIPE     ( XT_BITPOS0 )
#define F280X_COMCON_POS_C2TRIPE     ( XT_BITPOS1 )
#define F280X_COMCON_POS_C3TRIPE     ( XT_BITPOS2 )
// NOTE: bits 3 & 4 reserved
#define F280X_COMCON_POS_FCMP1OE     ( XT_BITPOS5 )
#define F280X_COMCON_POS_FCMP2OE     ( XT_BITPOS6 )
#define F280X_COMCON_POS_FCMP3OE     ( XT_BITPOS7 )
#define F280X_COMCON_POS_PDPINT      ( XT_BITPOS8 )
#define F280X_COMCON_POS_FCMPOE      ( XT_BITPOS9 )
#define F280X_COMCON_POS_ACTRLD0     ( XT_BITPOS10 )
#define F280X_COMCON_POS_ACTRLD1     ( XT_BITPOS11 )
#define F280X_COMCON_POS_SVENABLE    ( XT_BITPOS12 )
#define F280X_COMCON_POS_CLD0        ( XT_BITPOS13 )
#define F280X_COMCON_POS_CLD1        ( XT_BITPOS14 )
#define F280X_COMCON_POS_CENABLE     ( XT_BITPOS15 )

// Use these defines to configure the COMCON register
//Compare enable
#define F280X_COMCON_CENABLE_EN      ( 1 << F280X_COMCON_POS_CENABLE )
//Compare disable
#define F280X_COMCON_CENABLE_DIS     ( 0 << F280X_COMCON_POS_CENABLE )
//Reserved by TI
#define F280X_COMCON_CLD_RESERVED    ( 3 << F280X_COMCON_POS_CLD0 )
//Reload CMPRx immediately
#define F280X_COMCON_CLD_IMM         ( 2 << F280X_COMCON_POS_CLD0 )
//Reload CMPRx on T1CNT0 or period
#define F280X_COMCON_CLD_UF_PD       ( 1 << F280X_COMCON_POS_CLD0 )
//Reload CMPRx on T1CNT0
#define F280X_COMCON_CLD_UF          ( 0 << F280X_COMCON_POS_CLD0 )
//Enable space vector PWM
#define F280X_COMCON_SVENABLE_EN     ( 1 << F280X_COMCON_POS_SVENABLE )
//Disable space vector PWM
#define F280X_COMCON_SVENABLE_DIS    ( 0 << F280X_COMCON_POS_SVENABLE )
//Reserved by TI
#define F280X_COMCON_ACTRLD_RESERVED ( 3 << F280X_COMCON_POS_ACTRLD0 )
//Reload action reg immediately
#define F280X_COMCON_ACTRLD_IMM      ( 2 << F280X_COMCON_POS_ACTRLD0 )
//Reload action reg on T1CNT0 or per
#define F280X_COMCON_ACTRLD_UF_PD    ( 1 << F280X_COMCON_POS_ACTRLD0 )
//Reload action reg on T1CNT0
#define F280X_COMCON_ACTRLD_UF       ( 0 << F280X_COMCON_POS_ACTRLD0 )
//PWM output pins are not HI-Z (en)
#define F280X_COMCON_FCMPOE_EN       ( 1 << F280X_COMCON_POS_FCMPOE )
//PWM output pins are HI-Z (dis)
#define F280X_COMCON_FCMPOE_DIS      ( 0 << F280X_COMCON_POS_FCMPOE )

