jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// Compare Action Control Register bit positions (ACTRA)
#define F280X_ACTR_POS_SVRDIR        ( XT_BITPOS15 )
#define F280X_ACTR_POS_SVB_D2        ( XT_BITPOS14 )
#define F280X_ACTR_POS_SVB_D1        ( XT_BITPOS13 )
#define F280X_ACTR_POS_SVB_D0        ( XT_BITPOS12 )
#define F280X_ACTR_POS_CMP12ACT1     ( XT_BITPOS11 )
#define F280X_ACTR_POS_CMP12ACT0     ( XT_BITPOS10 )
#define F280X_ACTR_POS_CMP11ACT1     ( XT_BITPOS9 )
#define F280X_ACTR_POS_CMP11ACT0     ( XT_BITPOS8 )
#define F280X_ACTR_POS_CMP10ACT1     ( XT_BITPOS7 )
#define F280X_ACTR_POS_CMP10ACT0     ( XT_BITPOS6 )
#define F280X_ACTR_POS_CMP9ACT1      ( XT_BITPOS5 )
#define F280X_ACTR_POS_CMP9ACT0      ( XT_BITPOS4 )
#define F280X_ACTR_POS_CMP8ACT1      ( XT_BITPOS3 )
#define F280X_ACTR_POS_CMP8ACT0      ( XT_BITPOS2 )
#define F280X_ACTR_POS_CMP7ACT1      ( XT_BITPOS1 )
#define F280X_ACTR_POS_CMP7ACT0      ( XT_BITPOS0 )
#define F280X_ACTR_POS_CMP6ACT1      ( XT_BITPOS11 )
#define F280X_ACTR_POS_CMP6ACT0      ( XT_BITPOS10 )
#define F280X_ACTR_POS_CMP5ACT1      ( XT_BITPOS9 )
#define F280X_ACTR_POS_CMP5ACT0      ( XT_BITPOS8 )
#define F280X_ACTR_POS_CMP4ACT1      ( XT_BITPOS7 )
#define F280X_ACTR_POS_CMP4ACT0      ( XT_BITPOS6 )
#define F280X_ACTR_POS_CMP3ACT1      ( XT_BITPOS5 )
#define F280X_ACTR_POS_CMP3ACT0      ( XT_BITPOS4 )
#define F280X_ACTR_POS_CMP2ACT1      ( XT_BITPOS3 )
#define F280X_ACTR_POS_CMP2ACT0      ( XT_BITPOS2 )
#define F280X_ACTR_POS_CMP1ACT1      ( XT_BITPOS1 )
#define F280X_ACTR_POS_CMP1ACT0      ( XT_BITPOS0 )

//
// 280X External Memory Interface
//

// XINTF Configuration Register

// XTIMCLK divisor
#define F280X_XINTFCNF2_XTIMCLK_SYSCLKOUT_DIV_2          ( 1 )
#define F280X_XINTFCNF2_XTIMCLK_SYSCLKOUT_DIV_1          ( 0 )

// External bus access
#define F280X_XINTFCNF2_HOLD_AUTO_GRANT                  ( 0 )
#define F280X_XINTFCNF2_HOLD_NO_GRANT                    ( 1 )

// Microprocessor / Microcomputer mode
#define F280X_XINTFCNF2_MPNMC_MICROPROCESSOR_MODE        ( 1 )
#define F280X_XINTFCNF2_MPNMC_MICROCOMPUTER_MODE         ( 0 )

// XCLKOUT
#define F280X_XINTFCNF2_CLKOFF_XCLKOUT_ENABLE            ( 0 )
#define F280X_XINTFCNF2_CLKOFF_XCLKOUT_DISABLE           ( 1 )

// Clock Mode
#define F280X_XINTFCNF2_CLKMODE_XTIMCLK_DIV_2            ( 1 )
#define F280X_XINTFCNF2_CLKMODE_XTIMCLK_DIV_1            ( 0 )

// Write Buffer Depth
#define F280X_XINTFCNF2_WRITEBUFFER_EMPTY                ( 0 )
#define F280X_XINTFCNF2_WRITEBUFFER_0                    ( 0 )
#define F280X_XINTFCNF2_WRITEBUFFER_1                    ( 1 )
#define F280X_XINTFCNF2_WRITEBUFFER_2                    ( 2 )
#define F280X_XINTFCNF2_WRITEBUFFER_3                    ( 3 )
#define F280X_XINTFCNF2_WRITEBUFFER_FULL                 ( 3 )

// XTIMINGx Register

// Wait State Scale Factor
#define F280X_XTIMINGX_X2TIMING_ENABLED                  ( 1 )
#define F280X_XTIMINGX_X2TIMING_DISABLED                 ( 0 )

// memory width
#define F280X_XTIMINGX_XSIZE_16BIT                       ( 3 )

// Ready Mode
#define F280X_XTIMINGX_XREADY_SYNCHRONOUS                ( 0 )
#define F280X_XTIMINGX_XREADY_ASYNCHRONOUS               ( 1 )

// Ready Signal
#define F280X_XTIMINGX_USEREADY_ENABLED                  ( 1 )
#define F280X_XTIMINGX_USEREADY_DISABLED                 ( 0 )

// External Memory Interface Wait States
#define F280X_XTIMINGX_WAIT_1_STATE                      ( 1 )
#define F280X_XTIMINGX_WAIT_2_STATES                     ( 2 )
#define F280X_XTIMINGX_WAIT_3_STATES                     ( 3 )
#define F280X_XTIMINGX_WAIT_4_STATES                     ( 4 )
#define F280X_XTIMINGX_WAIT_5_STATES                     ( 5 )
#define F280X_XTIMINGX_WAIT_6_STATES                     ( 6 )
#define F280X_XTIMINGX_WAIT_7_STATES                     ( 7 )

//
// Flash/OTP Configuration definitions
//

// Flash Options Register
#define F280X_FOPT_PIPELINE_ENABLED                      ( 1 )
#define F280X_FOPT_PIPELINE_DISABLED                     ( 0 )

// Flash Status Register
#define F280X_FSTATUS_CLEAR_V3STAT                       ( 1 )

// Flash Power Register
#define F280X_FPWR_PUMP_BANK_SLEEP                       ( 0 )
#define F280X_FPWR_PUMP_BANK_STDBY                       ( 1 )
#define F280X_FPWR_PUMP_BANK_ACTIVE                      ( 3 )

// Standby Wait Register
#define F280X_FSTDBYWAIT_MAX_WAIT                        ( 0x01FF )

// Active Wait Register
#define F280X_FACTIVEWAIT_MAX_WAIT                       ( 0x01FF )

// Bank Wait states
#define F280X_FBANKWAIT_0_STATES                         ( 0 )
#define F280X_FBANKWAIT_1_STATES                         ( 1 )
#define F280X_FBANKWAIT_2_STATES                         ( 2 )
#define F280X_FBANKWAIT_3_STATES                         ( 3 )
#define F280X_FBANKWAIT_4_STATES                         ( 4 )
#define F280X_FBANKWAIT_5_STATES                         ( 5 )
#define F280X_FBANKWAIT_6_STATES                         ( 6 )
#define F280X_FBANKWAIT_7_STATES                         ( 7 )
#define F280X_FBANKWAIT_8_STATES                         ( 8 )
#define F280X_FBANKWAIT_9_STATES                         ( 9 )
#define F280X_FBANKWAIT_10_STATES                        ( 10 )
#define F280X_FBANKWAIT_11_STATES                        ( 11 )
#define F280X_FBANKWAIT_12_STATES                        ( 12 )
#define F280X_FBANKWAIT_13_STATES                        ( 13 )
#define F280X_FBANKWAIT_14_STATES                        ( 14 )
#define F280X_FBANKWAIT_15_STATES                        ( 15 )



//------------------------------------------------------------------------------
//            BEGIN NFO AND MACRO USE DEFINITIONS
// All definitions below are used with the macros defined at the end of the file
//
// Notes:
//     NFO means Info
//     This convention was used to reduce the number of definitions for each
//     register.  This way we only have to define the field configuraiton once 
//     and use macros to extract bit mask combos.
//     It does not take up any processor time nor any more code because it is
//     all done using prepocessor definitions.
//     
//------------------------------------------------------------------------------

//
// GPIO module
//


//
// System Control and Interrupt module
//

// Peripheral Clock Control 0 (PCLKCR0)
#define F280X_PCLKCR0_TBCLKSYNC_NFO                        F280X_mNFO(  2,  1 )
#define F280X_PCLKCR0_ADCENCLK_NFO                         F280X_mNFO(  3,  1 )
#define F280X_PCLKCR0_I2CAENCLK_NFO                        F280X_mNFO(  4,  1 )
#define F280X_PCLKCR0_SPICENCLK_NFO                        F280X_mNFO(  6,  1 )
#define F280X_PCLKCR0_SPIDENCLK_NFO                        F280X_mNFO(  7,  1 )
#define F280X_PCLKCR0_SPIAENCLK_NFO                        F280X_mNFO(  8,  1 )
#define F280X_PCLKCR0_SPIBENCLK_NFO                        F280X_mNFO(  9,  1 )
#define F280X_PCLKCR0_SCIAENCLK_NFO                        F280X_mNFO( 10,  1 )
#define F280X_PCLKCR0_SCIBENCLK_NFO                        F280X_mNFO( 11,  1 )
#define F280X_PCLKCR0_ECANAENCLK_NFO                       F280X_mNFO( 14,  1 )
#define F280X_PCLKCR0_ECANBENCLK_NFO                       F280X_mNFO( 15,  1 )

#define F280X_PCLKCR0_TBCLKSYNC_DIS                        ( 0 )
#define F280X_PCLKCR0_TBCLKSYNC_ENA                        ( 1 )
#define F280X_PCLKCR0_ADCENCLK_DIS                         ( 0 )
#define F280X_PCLKCR0_ADCENCLK_ENA                         ( 1 )
#define F280X_PCLKCR0_I2CAENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_I2CAENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SPICENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SPICENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SPIDENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SPIDENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SPIAENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SPIAENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SPIBENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SPIBENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SCIAENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SCIAENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_SCIBENCLK_DIS                        ( 0 )
#define F280X_PCLKCR0_SCIBENCLK_ENA                        ( 1 )
#define F280X_PCLKCR0_ECANAENCLK_DIS                       ( 0 )
#define F280X_PCLKCR0_ECANAENCLK_ENA                       ( 1 )
#define F280X_PCLKCR0_ECANBENCLK_DIS                       ( 0 )
#define F280X_PCLKCR0_ECANBENCLK_ENA                       ( 1 )


// Peripheral Clock Control 1 (PCLKCR1)
#define F280X_PCLKCR1_EPWM1ENCLK_NFO                        F280X_mNFO(  0,  1 )
#define F280X_PCLKCR1_EPWM2ENCLK_NFO                        F280X_mNFO(  1,  1 )
#define F280X_PCLKCR1_EPWM3ENCLK_NFO                        F280X_mNFO(  2,  1 )
#define F280X_PCLKCR1_EPWM4ENCLK_NFO                        F280X_mNFO(  3,  1 )
#define F280X_PCLKCR1_EPWM5ENCLK_NFO                        F280X_mNFO(  4,  1 )
#define F280X_PCLKCR1_EPWM6ENCLK_NFO                        F280X_mNFO(  5,  1 )
#define F280X_PCLKCR1_ECAP1ENCLK_NFO                        F280X_mNFO(  8,  1 )
#define F280X_PCLKCR1_ECAP2ENCLK_NFO                        F280X_mNFO(  9,  1 )
#define F280X_PCLKCR1_ECAP3ENCLK_NFO                        F280X_mNFO( 10,  1 )
#define F280X_PCLKCR1_ECAP4ENCLK_NFO                        F280X_mNFO( 11,  1 )
#define F280X_PCLKCR1_EQEP1ENCLK_NFO                        F280X_mNFO( 14,  1 )
#define F280X_PCLKCR1_EQEP2ENCLK_NFO                        F280X_mNFO( 15,  1 )

#define F280X_PCLKCR1_EPWM1ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM1ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EPWM2ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM2ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EPWM3ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM3ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EPWM4ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM4ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EPWM5ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM5ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EPWM6ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EPWM6ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_ECAP1ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_ECAP1ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_ECAP2ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_ECAP2ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_ECAP3ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_ECAP3ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_ECAP4ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_ECAP4ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EQEP1ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EQEP1ENCLK_ENA                        ( 1 )
#define F280X_PCLKCR1_EQEP1ENCLK_DIS                        ( 0 )
#define F280X_PCLKCR1_EQEP1ENCLK_ENA                        ( 1 )

// 
// PWM module bit definitions
//

// Time Base Control (TBCTL)
#define F280X_TBCTL_CTRMODE_NFO                             F280X_mNFO(  0,  2 )
#define F280X_TBCTL_PHSEN_NFO                               F280X_mNFO(  2,  1 )
#define F280X_TBCTL_PRDLD_NFO                               F280X_mNFO(  3,  1 )
#define F280X_TBCTL_SYNCOSEL_NFO                            F280X_mNFO(  4,  2 )
#define F280X_TBCTL_SWFSYNC_NFO                             F280X_mNFO(  6,  1 )
#define F280X_TBCTL_HSPCLKDIV_NFO                           F280X_mNFO(  7,  3 )
#define F280X_TBCTL_CLKDIV_NFO                              F280X_mNFO( 10,  3 )
#define F280X_TBCTL_PHSDIR_NFO                              F280X_mNFO( 13,  1 )
#define F280X_TBCTL_FREESOFT_NFO                            F280X_mNFO( 14,  2 )

