jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
#define F280X_TBCTL_CTRMODE_COUNT_UP                        ( 0 )
#define F280X_TBCTL_CTRMODE_COUNT_DN                        ( 1 )
#define F280X_TBCTL_CTRMODE_COUNT_UPDN                      ( 2 )
#define F280X_TBCTL_CTRMODE_FREEZE                          ( 3 )
#define F280X_TBCTL_PHSEN_DIS                               ( 0 )
#define F280X_TBCTL_PHSEN_ENA                               ( 1 )
#define F280X_TBCTL_PRDLD_SHDW                              ( 0 )
#define F280X_TBCTL_PRDLD_IMMED                             ( 1 )
#define F280X_TBCTL_SYNCOSEL_EPWMXSYNCI                     ( 0 )
#define F280X_TBCTL_SYNCOSEL_CTR_EQU_ZRO                    ( 1 )
#define F280X_TBCTL_SYNCOSEL_CTR_EQU_CMPB                   ( 2 )
#define F280X_TBCTL_SYNCOSEL_DIS                            ( 3 )
#define F280X_TBCTL_SWFSYNC_SYNC                            ( 1 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_1                       ( 0 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_2                       ( 1 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_4                       ( 2 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_6                       ( 3 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_8                       ( 4 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_10                      ( 5 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_12                      ( 6 )
#define F280X_TBCTL_HSPCLKDIV_DIVBY_14                      ( 7 )
#define F280X_TBCTL_CLKDIV_DIVBY_1                          ( 0 )
#define F280X_TBCTL_CLKDIV_DIVBY_2                          ( 1 )
#define F280X_TBCTL_CLKDIV_DIVBY_4                          ( 2 )
#define F280X_TBCTL_CLKDIV_DIVBY_8                          ( 3 )
#define F280X_TBCTL_CLKDIV_DIVBY_16                         ( 4 )
#define F280X_TBCTL_CLKDIV_DIVBY_32                         ( 5 )
#define F280X_TBCTL_CLKDIV_DIVBY_64                         ( 6 )
#define F280X_TBCTL_CLKDIV_DIVBY_128                        ( 7 )
#define F280X_TBCTL_PHSDIR_COUNT_DN                         ( 0 )
#define F280X_TBCTL_PHSDIR_COUNT_UP                         ( 1 )
#define F280X_TBCTL_FREESOFT_STOP_NEXT_CNTR                 ( 0 )
#define F280X_TBCTL_FREESOFT_STOP_NEXT_CYCLE                ( 1 )
#define F280X_TBCTL_FREESOFT_FREE                           ( 2 )

// Action-qualifier Output A control Register (AQCTLA)
#define F280X_AQCTLA_ZRO_NFO                                F280X_mNFO(  0,  2 )
#define F280X_AQCTLA_PRD_NFO                                F280X_mNFO(  2,  2 )
#define F280X_AQCTLA_CAU_NFO                                F280X_mNFO(  4,  2 )
#define F280X_AQCTLA_CAD_NFO                                F280X_mNFO(  6,  2 )
#define F280X_AQCTLA_CBU_NFO                                F280X_mNFO(  8,  2 )
#define F280X_AQCTLA_CBD_NFO                                F280X_mNFO(  10, 2 )

#define F280X_AQCTLA_ZRO_DIS                                ( 0 )
#define F280X_AQCTLA_ZRO_CLR                                ( 1 )
#define F280X_AQCTLA_ZRO_SET                                ( 2 )
#define F280X_AQCTLA_ZRO_TOG                                ( 3 )
#define F280X_AQCTLA_PRD_DIS                                ( 0 )
#define F280X_AQCTLA_PRD_CLR                                ( 1 )
#define F280X_AQCTLA_PRD_SET                                ( 2 )
#define F280X_AQCTLA_PRD_TOG                                ( 3 )
#define F280X_AQCTLA_CAU_DIS                                ( 0 )
#define F280X_AQCTLA_CAU_CLR                                ( 1 )
#define F280X_AQCTLA_CAU_SET                                ( 2 )
#define F280X_AQCTLA_CAU_TOG                                ( 3 )
#define F280X_AQCTLA_CAD_DIS                                ( 0 )
#define F280X_AQCTLA_CAD_CLR                                ( 1 )
#define F280X_AQCTLA_CAD_SET                                ( 2 )
#define F280X_AQCTLA_CAD_TOG                                ( 3 )
#define F280X_AQCTLA_CBU_DIS                                ( 0 )
#define F280X_AQCTLA_CBU_CLR                                ( 1 )
#define F280X_AQCTLA_CBU_SET                                ( 2 )
#define F280X_AQCTLA_CBU_TOG                                ( 3 )
#define F280X_AQCTLA_CBD_DIS                                ( 0 )
#define F280X_AQCTLA_CBD_CLR                                ( 1 )
#define F280X_AQCTLA_CBD_SET                                ( 2 )
#define F280X_AQCTLA_CBD_TOG                                ( 3 )


// Action-qualifier Output B control Register (AQCTLB)
#define F280X_AQCTLB_ZRO_NFO                                F280X_mNFO(  0,  2 )
#define F280X_AQCTLB_PRD_NFO                                F280X_mNFO(  2,  2 )
#define F280X_AQCTLB_CAU_NFO                                F280X_mNFO(  4,  2 )
#define F280X_AQCTLB_CAD_NFO                                F280X_mNFO(  6,  2 )
#define F280X_AQCTLB_CBU_NFO                                F280X_mNFO(  8,  2 )
#define F280X_AQCTLB_CBD_NFO                                F280X_mNFO(  10, 2 )

#define F280X_AQCTLB_ZRO_DIS                                ( 0 )
#define F280X_AQCTLB_ZRO_CLR                                ( 1 )
#define F280X_AQCTLB_ZRO_SET                                ( 2 )
#define F280X_AQCTLB_ZRO_TOG                                ( 3 )
#define F280X_AQCTLB_PRD_DIS                                ( 0 )
#define F280X_AQCTLB_PRD_CLR                                ( 1 )
#define F280X_AQCTLB_PRD_SET                                ( 2 )
#define F280X_AQCTLB_PRD_TOG                                ( 3 )
#define F280X_AQCTLB_CAU_DIS                                ( 0 )
#define F280X_AQCTLB_CAU_CLR                                ( 1 )
#define F280X_AQCTLB_CAU_SET                                ( 2 )
#define F280X_AQCTLB_CAU_TOG                                ( 3 )
#define F280X_AQCTLB_CAD_DIS                                ( 0 )
#define F280X_AQCTLB_CAD_CLR                                ( 1 )
#define F280X_AQCTLB_CAD_SET                                ( 2 )
#define F280X_AQCTLB_CAD_TOG                                ( 3 )
#define F280X_AQCTLB_CBU_DIS                                ( 0 )
#define F280X_AQCTLB_CBU_CLR                                ( 1 )
#define F280X_AQCTLB_CBU_SET                                ( 2 )
#define F280X_AQCTLB_CBU_TOG                                ( 3 )
#define F280X_AQCTLB_CBD_DIS                                ( 0 )
#define F280X_AQCTLB_CBD_CLR                                ( 1 )
#define F280X_AQCTLB_CBD_SET                                ( 2 )
#define F280X_AQCTLB_CBD_TOG                                ( 3 )


// Action-qualifier S/W Force Register (AQSFRC)
#define F280X_AQSFRC_ACTSFA_NFO                             F280X_mNFO(  0,  2 )
#define F280X_AQSFRC_OTSFA_NFO                              F280X_mNFO(  2,  1 )
#define F280X_AQSFRC_ACTSFB_NFO                             F280X_mNFO(  3,  2 )
#define F280X_AQSFRC_OTSFB_NFO                              F280X_mNFO(  5,  1 )
#define F280X_AQSFRC_RLDCSF_NFO                             F280X_mNFO(  6,  2 )

#define F280X_AQSFRC_ACTSFA_DIS                             ( 0 )
#define F280X_AQSFRC_ACTSFA_CLR                             ( 1 )
#define F280X_AQSFRC_ACTSFA_SET                             ( 2 )
#define F280X_AQSFRC_OTSFA_TRIG                             ( 1 )
#define F280X_AQSFRC_ACTSFB_DIS                             ( 0 )
#define F280X_AQSFRC_ACTSFB_CLR                             ( 1 )
#define F280X_AQSFRC_ACTSFB_SET                             ( 2 )
#define F280X_AQSFRC_OTSFB_TRIG                             ( 1 )
#define F280X_AQSFRC_RLDCSF_LOAD_ON_ZRO                     ( 0 )
#define F280X_AQSFRC_RLDCSF_LOAD_ON_PRD                     ( 1 )
#define F280X_AQSFRC_RLDCSF_LOAD_ON_ZRO_OR_PRD              ( 2 )
#define F280X_AQSFRC_RLDCSF_IMMED                           ( 3 )


// Action-qualifier Continuous S/F Force Register (AQCSFRC)
#define F280X_AQCSFRC_CSFA_NFO                              F280X_mNFO(  0,  2 )
#define F280X_AQCSFRC_CSFB_NFO                              F280X_mNFO(  2,  2 )

#define F280X_AQCSFRC_CSFA_DIS                              ( 0 )
#define F280X_AQCSFRC_CSFA_LOW                              ( 1 )
#define F280X_AQCSFRC_CSFA_HIGH                             ( 2 )
#define F280X_AQCSFRC_CSFB_DIS                              ( 0 )
#define F280X_AQCSFRC_CSFB_LOW                              ( 1 )
#define F280X_AQCSFRC_CSFB_HIGH                             ( 2 )


// Compare Control (CMPCTL)
#define F280X_CMPCTL_LOADAMODE_NFO                          F280X_mNFO(  1,  2 )
#define F280X_CMPCTL_LOADBMODE_NFO                          F280X_mNFO(  2,  2 )
#define F280X_CMPCTL_SHDWAMODE_NFO                          F280X_mNFO(  4,  1 )
#define F280X_CMPCTL_SHDWBMODE_NFO                          F280X_mNFO(  6,  1 )
#define F280X_CMPCTL_SHDWAFULL_NFO                          F280X_mNFO(  8,  1 )
#define F280X_CMPCTL_SHDWBFULL_NFO                          F280X_mNFO(  9,  1 )

#define F280X_CMPCTL_LOADAMODE_ZRO                          ( 0 )
#define F280X_CMPCTL_LOADAMODE_PRD                          ( 1 )
#define F280X_CMPCTL_LOADAMODE_ZRO_OR_PRD                   ( 2 )
#define F280X_CMPCTL_LOADAMODE_FREEZE                       ( 3 )
#define F280X_CMPCTL_LOADBMODE_ZRO                          ( 0 )
#define F280X_CMPCTL_LOADBMODE_PRD                          ( 1 )
#define F280X_CMPCTL_LOADBMODE_ZRO_OR_PRD                   ( 2 )
#define F280X_CMPCTL_LOADBMODE_FREEZE                       ( 3 )
#define F280X_CMPCTL_SHDWAMODE_SHDW                         ( 0 )
#define F280X_CMPCTL_SHDWAMODE_IMMED                        ( 1 )
#define F280X_CMPCTL_SHDWBMODE_SHDW                         ( 0 )
#define F280X_CMPCTL_SHDWBMODE_IMMED                        ( 1 )
#define F280X_CMPCTL_SHDWAFULL_NOT_FULL                     ( 0 )
#define F280X_CMPCTL_SHDWAFULL_FULL                         ( 1 )
#define F280X_CMPCTL_SHDWBFULL_NOT_FULL                     ( 0 )
#define F280X_CMPCTL_SHDWBFULL_FULL                         ( 0 )


