jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// High Resolution PWM Configuration (HRCNFG)
#define F280X_HRCNFG_EDGMODE_NFO                            F280X_mNFO(  0,  2 )
#define F280X_HRCNFG_CTLMODE_NFO                            F280X_mNFO(  2,  1 )
#define F280X_HRCNFG_HRLOAD_NFO                             F280X_mNFO(  3,  1 )

#define F280X_HRCNFG_EDGMODE_DIS                            ( 0 )
#define F280X_HRCNFG_EDGMODE_RISE                           ( 1 )
#define F280X_HRCNFG_EDGMODE_FALL                           ( 2 )
#define F280X_HRCNFG_EDGMODE_RISE_FALL                      ( 3 )
#define F280X_HRCNFG_CTLMODE_DUTY                           ( 0 )
#define F280X_HRCNFG_CTLMODE_PHASE                          ( 1 )

// TBD waiting for JTate's response on one bit or 2
//#define F280X_HRCNFG_HRLOAD_ZRO                             ( 0 )
//#define F280X_HRCNFG_HRLOAD_PRD                             ( 1 )
//#define F280X_HRCNFG_HRLOAD_ZRO_OR_PRD                      ( 2 )
//#define F280X_HRCNFG_HRLOAD_NO_LOAD                         ( 3 )


// Deadband control (DBCTL)
#define F280X_DBCTL_OUT_MODE_NFO                            F280X_mNFO(  0,  2 )
#define F280X_DBCTL_POLSEL_NFO                              F280X_mNFO(  2,  2 )

#define F280X_DBCTL_OUT_MODE_DIS                            ( 0 )
#define F280X_DBCTL_OUT_MODE_DELAYB                         ( 1 )
#define F280X_DBCTL_OUT_MODE_DELAYA                         ( 2 )
#define F280X_DBCTL_OUT_MODE_ENA                            ( 3 )
#define F280X_DBCTL_POLSEL_ACTIVE_HIGH                      ( 0 )
#define F280X_DBCTL_POLSEL_ACTIVE_LOW_COMPL                 ( 1 )
#define F280X_DBCTL_POLSEL_ACTIVE_HIGH_COMPL                ( 2 )
#define F280X_DBCTL_POLSEL_ACTIVE_LOW                       ( 3 )


// Deadband Rising Edge Delay (DBRED)
#define F280X_DBRED_DEL_NFO                                 F280X_mNFO(  0, 10 )

// Deadband Falling Edge Delay (DBFED)
#define F280X_DBFED_DEL_NFO                                 F280X_mNFO(  0, 10 )


// Trip-zone Select (TZSEL)
#define F280X_TZSEL_CBC1_NFO                                F280X_mNFO(  0,  1 )
#define F280X_TZSEL_CBC2_NFO                                F280X_mNFO(  1,  1 )
#define F280X_TZSEL_CBC3_NFO                                F280X_mNFO(  2,  1 )
#define F280X_TZSEL_CBC4_NFO                                F280X_mNFO(  3,  1 )
#define F280X_TZSEL_CBC5_NFO                                F280X_mNFO(  4,  1 )
#define F280X_TZSEL_CBC6_NFO                                F280X_mNFO(  5,  1 )
#define F280X_TZSEL_OSHT1_NFO                               F280X_mNFO(  8,  1 )
#define F280X_TZSEL_OSHT2_NFO                               F280X_mNFO(  9,  1 )
#define F280X_TZSEL_OSHT3_NFO                               F280X_mNFO( 10,  1 )
#define F280X_TZSEL_OSHT4_NFO                               F280X_mNFO( 11,  1 )
#define F280X_TZSEL_OSHT5_NFO                               F280X_mNFO( 12,  1 )
#define F280X_TZSEL_OSHT6_NFO                               F280X_mNFO( 13,  1 )

#define F280X_TZSEL_CBC1_DIS                                ( 0 )
#define F280X_TZSEL_CBC1_ENA                                ( 1 )
#define F280X_TZSEL_CBC2_DIS                                ( 0 )
#define F280X_TZSEL_CBC2_ENA                                ( 1 )
#define F280X_TZSEL_CBC3_DIS                                ( 0 )
#define F280X_TZSEL_CBC3_ENA                                ( 1 )
#define F280X_TZSEL_CBC4_DIS                                ( 0 )
#define F280X_TZSEL_CBC4_ENA                                ( 1 )
#define F280X_TZSEL_CBC5_DIS                                ( 0 )
#define F280X_TZSEL_CBC5_ENA                                ( 1 )
#define F280X_TZSEL_CBC6_DIS                                ( 0 )
#define F280X_TZSEL_CBC6_ENA                                ( 1 )
#define F280X_TZSEL_OSHT1_DIS                               ( 0 )
#define F280X_TZSEL_OSHT1_ENA                               ( 1 )
#define F280X_TZSEL_OSHT2_DIS                               ( 0 )
#define F280X_TZSEL_OSHT2_ENA                               ( 1 )
#define F280X_TZSEL_OSHT3_DIS                               ( 0 )
#define F280X_TZSEL_OSHT3_ENA                               ( 1 )
#define F280X_TZSEL_OSHT4_DIS                               ( 0 )
#define F280X_TZSEL_OSHT4_ENA                               ( 1 )
#define F280X_TZSEL_OSHT5_DIS                               ( 0 )
#define F280X_TZSEL_OSHT5_ENA                               ( 1 )
#define F280X_TZSEL_OSHT6_DIS                               ( 0 )
#define F280X_TZSEL_OSHT6_ENA                               ( 1 )

// Trip-zone Control (TZCTL)
#define F280X_TZCTL_TZA_NFO                                 F280X_mNFO(  0,  2 )
#define F280X_TZCTL_TZB_NFO                                 F280X_mNFO(  2,  2 )

#define F280X_TZCTL_TZA_HIGH_IMPEDANCE                      ( 0 )
#define F280X_TZCTL_TZA_FORCED_HIGH                         ( 1 )
#define F280X_TZCTL_TZA_FORCED_LOW                          ( 2 )
#define F280X_TZCTL_TZA_DIS                                 ( 3 )
#define F280X_TZCTL_TZB_HIGH_IMPEDANCE                      ( 0 )
#define F280X_TZCTL_TZB_FORCED_HIGH                         ( 1 )
#define F280X_TZCTL_TZB_FORCED_LOW                          ( 2 )
#define F280X_TZCTL_TZB_DIS                                 ( 3 )


// Trip-zone Enable Interrupt (TZEINT)
#define F280X_TZEINT_CBC_NFO                                F280X_mNFO(  1,  1 )
#define F280X_TZEINT_OST_NFO                                F280X_mNFO(  2,  1 )

#define F280X_TZEINT_CBC_DIS                                ( 0 )
#define F280X_TZEINT_CBC_ENA                                ( 1 )
#define F280X_TZEINT_OST_DIS                                ( 0 )
#define F280X_TZEINT_OST_ENA                                ( 1 )


// Trip-zone Force (TZFRC)
#define F280X_TZFRC_CBC_NFO                                 F280X_mNFO(  1,  1 )
#define F280X_TZFRC_OST_NFO                                 F280X_mNFO(  2,  1 )

#define F280X_TZFRC_CBC_FORCE_FAULT                         ( 1 )
#define F280X_TZFRC_OST_FORCE_FAULT                         ( 1 )


