jodhsinghnahal/catkin_ws/Code/Pkgs/Targets/TI/28x/280x/Inc/F280xBitDefines.h
// Trip-zone Clear (TZCLR)
#define F280X_TZCLR_INT_NFO                                 F280X_mNFO(  0,  1 )
#define F280X_TZCLR_CBC_NFO                                 F280X_mNFO(  1,  1 )
#define F280X_TZCLR_OST_NFO                                 F280X_mNFO(  2,  1 )

#define F280X_TZCLR_INT_CLR                                 ( 1 )
#define F280X_TZCLR_CBC_CLR                                 ( 1 )
#define F280X_TZCLR_OST_CLR                                 ( 1 )


// Event Trigger Selection Register (ETSEL)
#define F280X_ETSEL_INTSEL_NFO                              F280X_mNFO(  0,  3 )
#define F280X_ETSEL_INTEN_NFO                               F280X_mNFO(  3,  1 )
#define F280X_ETSEL_SOCASEL_NFO                             F280X_mNFO(  8,  3 )
#define F280X_ETSEL_SOCAEN_NFO                              F280X_mNFO( 11,  1 )
#define F280X_ETSEL_SOCBSEL_NFO                             F280X_mNFO( 12,  3 )
#define F280X_ETSEL_SOCBEN_NFO                              F280X_mNFO( 15,  1 )

#define F280X_ETSEL_INTSEL_CTR_EQU_ZRO                      ( 0 )
#define F280X_ETSEL_INTSEL_CTR_PRD_ZRO                      ( 1 )
#define F280X_ETSEL_INTSEL_CTRU_EQU_CMPA                    ( 4 )
#define F280X_ETSEL_INTSEL_CTRD_EQU_CMPA                    ( 5 )
#define F280X_ETSEL_INTSEL_CTRU_EQU_CMPB                    ( 6 )
#define F280X_ETSEL_INTSEL_CTRD_EQU_CMPB                    ( 7 )
#define F280X_ETSEL_INTEN_DIS                               ( 0 )
#define F280X_ETSEL_INTEN_ENA                               ( 1 )
#define F280X_ETSEL_SOCASEL_CTR_EQU_ZRO                     ( 0 )
#define F280X_ETSEL_SOCASEL_CTR_PRD_ZRO                     ( 1 )
#define F280X_ETSEL_SOCASEL_CTRU_EQU_CMPA                   ( 4 )
#define F280X_ETSEL_SOCASEL_CTRD_EQU_CMPA                   ( 5 )
#define F280X_ETSEL_SOCASEL_CTRU_EQU_CMPB                   ( 6 )
#define F280X_ETSEL_SOCASEL_CTRD_EQU_CMPB                   ( 7 )
#define F280X_ETSEL_SOCAEN_DIS                              ( 0 )
#define F280X_ETSEL_SOCAEN_ENA                              ( 1 )
#define F280X_ETSEL_SOCBSEL_CTR_EQU_ZRO                     ( 0 )
#define F280X_ETSEL_SOCBSEL_CTR_PRD_ZRO                     ( 1 )
#define F280X_ETSEL_SOCBSEL_CTRU_EQU_CMPA                   ( 4 )
#define F280X_ETSEL_SOCBSEL_CTRD_EQU_CMPA                   ( 5 )
#define F280X_ETSEL_SOCBSEL_CTRU_EQU_CMPB                   ( 6 )
#define F280X_ETSEL_SOCBSEL_CTRD_EQU_CMPB                   ( 7 )
#define F280X_ETSEL_SOCBEN_DIS                              ( 0 )
#define F280X_ETSEL_SOCBEN_ENA                              ( 1 )


// Event Timer Prescale (ETPS)
#define F280X_ETPS_INTPRD_NFO                              F280X_mNFO(  0,  2 )
#define F280X_ETPS_INTCNT_NFO                              F280X_mNFO(  2,  2 )
#define F280X_ETPS_SOCAPRD_NFO                             F280X_mNFO(  8,  2 )
#define F280X_ETPS_SOCACNT_NFO                             F280X_mNFO( 10,  2 )
#define F280X_ETPS_SOCBPRD_NFO                             F280X_mNFO( 12,  2 )
#define F280X_ETPS_SOCBCNT_NFO                             F280X_mNFO( 14,  2 )

#define F280X_ETPS_INTPRD_DIS                              ( 0 )
#define F280X_ETPS_INTPRD_1                                ( 1 )
#define F280X_ETPS_INTPRD_2                                ( 2 )
#define F280X_ETPS_INTPRD_3                                ( 3 )
#define F280X_ETPS_SOCAPRD_DIS                             ( 0 )
#define F280X_ETPS_SOCAPRD_1                               ( 1 )
#define F280X_ETPS_SOCAPRD_2                               ( 2 )
#define F280X_ETPS_SOCAPRD_3                               ( 3 )
#define F280X_ETPS_SOCBPRD_DIS                             ( 0 )
#define F280X_ETPS_SOCBPRD_1                               ( 1 )
#define F280X_ETPS_SOCBPRD_2                               ( 2 )
#define F280X_ETPS_SOCBPRD_3                               ( 3 )


//
// Usage:
//    Call the macros with the the register name, function and 
//    configuration.  Do not use quotations.
//
//    ie.  EPwm1Regs.CMPCTL.all = F280X_mCFGMSK( CMPCTL, LOADBMODE, ZRO );

// !!! IMPORTANT !!!
// Defines must be in the following format:
// F280X_<RegName>_<Field>_NFO for field info.  ( use F280X_mNFO macro )
// F280X_<RegName>_<Field>_<Config> for function configurations
//  Note <Config> is anything after the <Field> ie it can use underscores.
//       F280X_mCFGMSK( TZFRC, CBC, FORCE_FAULT )
//
// Example:
//
// regname:         TZCTL
//         _________________________   
// fields: |  |  |  |  | TZB | TZA |
//         -------------------------
// bits:     7  6  5  4  3  2  1  0
//
// cfgs:
// TZA : 00=HIGH_IMPEDANCE, 01=FORCE_HIGH, 10=FORCED_LOW, 11=DIS
// TZB : 00=HIGH_IMPEDANCE, 01=FORCE_HIGH, 10=FORCED_LOW, 11=DIS

// Get NFO name
// F280X_mNFONAME( TZCTL, TZA ) returns F280X_TZCTL_TZA_NFO
// F280X_mNFONAME( TZCTL, TZB ) returns F280X_TZCTL_TZB_NFO
#define F280X_mNFONAME( RegName, Field ) \
            ( F280X_ ## RegName ## _ ## Field ## _NFO )
            
// Get left most position of field
// F280X_mPOS( TZCTL, TZA ) returns 0
// F280X_mPOS( TZCTL, TZB ) returns 2
#define F280X_mPOS( RegName, Field ) \
            ( ( F280X_mNFONAME( RegName, Field ) & F280X_NFO_POS_MSK ) \
            >> F280X_NFO_POS_SHFT )

// Get number of bits the field takes up
// F280X_mBITS( TZCTL, TZA ) returns 2
// F280X_mBITS( TZCTL, TZB ) returns 2
#define F280X_mBITS( RegName, Field ) \
            ( ( F280X_mNFONAME( RegName, Field ) & F280X_NFO_BITS_MSK ) \
            >> F280X_NFO_BITS_SHFT )

// Get the bit mask unshifted
// F280X_mMSK_UNSHFTD( TZCTL, TZA ) returns 0x0003
// F280X_mMSK_UNSHFTD( TZCTL, TZB ) returns 0x0003
#define F280X_mMSK_UNSHFTD( RegName, Field ) \
            ( F280X_mBITS_TO_MSK_UNSHFTD( F280X_mBITS( RegName, Field ) ) )

// Get the shifted field mask
// F280X_mFIELDMSK( TZCTL, TZA ) returns 0x0003
// F280X_mFIELDMSK( TZCTL, TZB ) returns 0x000C
#define F280X_mFIELDMSK( RegName, Field ) \
            ( F280X_mMSK_UNSHFTD( RegName, Field ) \
            << F280X_mPOS( RegName, Field ) )

// Get the configuration value unshifted
// F280X_mCFG( TZCTL, TZA, FORCED_HI ) returns 1
// F280X_mCFG( TZCTL, TZB, FORCED_HI ) returns 1
// F280X_mCFG( TZCTL, TZB, DIS )       returns 3
#define F280X_mCFG( RegName, Field, Config ) \
            ( F280X_ ## RegName ## _ ## Field ## _ ## Config )
            
// Get the configuration value shifted to the field position
// F280X_mCFGMSK( TZCTL, TZA, FORCED_HI ) returns 0x0001
// F280X_mCFGMSK( TZCTL, TZB, FORCED_HI ) returns 0x0004
// F280X_mCFGMSK( TZCTL, TZB, DIS )       returns 0x000C
#define F280X_mCFGMSK( RegName, Field, Config ) \
            ( F280X_mCFG( RegName, Field, Config ) \
            << F280X_mPOS( RegName, Field ) )



//
// ---------------------------------------------------------------------------
// Defines based on function
// ---------------------------------------------------------------------------


/*==============================================================================
                            Type Definitions
==============================================================================*/


/*==============================================================================
                                Enums
==============================================================================*/


/*=============================================================================
                              Structures
==============================================================================*/


/*==============================================================================
                          External/Public Constants
==============================================================================*/


/*==============================================================================
                          External/Public Variables
==============================================================================*/


/*==============================================================================
                      External/Public Function Protoypes
==============================================================================*/


#endif  // F280X_H
